sunmny/z1/z1-stm32l476/Src/APP/app_aoa.c
#include "hw_uart.h" 
#include "stm32l4xx_hal.h"
//#include "cmsis_os.h"
#include "string.h"
//#include "delay.h"
#include "app_aoa.h"
#include "hw_config.h"
#include "task_ble.h"
#include "zb_common_data.h"
#include "hw_bd1.h"
#include "app_bd1.h"
#include "hw_bd2.h"
#include "app_bd2.h"
#include "app_nvram.h"

#define SUPPORT_MAIL_NUM 1

#define BDEVICE_MAX_NUM 100
extern uint8_t save_nv_buf[70];


#define BDEVICE_GROUP_NUM   10

uint8_t DEVICE_ID_LEN = 12;
uint8_t wlist_count =0;
uint8_t bind_flag =0;
uint8_t aoa_uart_data_loop[AOA_UART_DATA_LOOP_SIZE+1];
extern osStatus task_aoauart_mail_put(uint8_t *data, uint16_t len);
uint16_t aoa_uart_data_loop_len;
//extern osTimerId ReportTimerHandle;
#define AT_END_TOK_LEN 4
static const uint8_t aoa_at_end_tok[4] = {0x23,0x23,0x0d,0x0a};//##\r\n
extern osTimerId LedTimerHandle;
uint8_t send_light_commnd = 0;
uint8_t timer_status =0;

uint8_t  get_timer_status(void)
{
	return timer_status ;
}
void set_timer_status(uint8_t status)
{
	timer_status = status;
	

}
typedef enum {
	TEST=0,
	ZSAVEB,
	TASKB,
	ZCALL,
	ZBEAT,
	ZBIND,
	ZUPDATE,
	RDSSPOWER,
	RNSSPOWER,
	AIRPLANEMODE,
	ZLOCATION,
	//BBROADCAST,
//	BCALL,
	BBIND,
	BUNBIND,
	BBEAT,
	BINFOWRITE,
	BBBEAT,
	BLIGHT,
	BINFOERASE,
	CENTERADDRESS,
	BSOSINFO,
	BSOS,
	//SELFCHECK,
	BDISTANCE,
	BLOWBATTERY,
	ZREPORTLOCTIME,
	BREPORTINFOTIME,
	//TASKOVER,
	BBOXUNLOCK,
	WARINGSTATUS,
	SUPPORT_AT_NUM
} aoa_at_request;
void set_command_type(uint8_t command);
uint8_t aoa_at_handle_zsaveb(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_zupdate(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_zbind(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_zcall(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_zbeat(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_rdsspower(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_rnsspower(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_airplanemode(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_zlocation(void);
uint8_t aoa_at_handle_bbroadcast(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_bcall(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_bbind(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_bunbind(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_bbeat(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_binfowrite(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_bbbeat(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_blight(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_binfoerase(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_centeraddress(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_bsosinfo(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_bsos(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_selfcheck(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_bdistance(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_blowbattery(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_zreportloctime(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_breportinfotime(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_taskover(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_bboxunlock(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_taskbegin(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_network(uint8_t *data, uint16_t len, uint8_t idx);
/***************at only for test start**********************/
uint8_t aoa_at_handle_rdmsg(uint8_t *data, uint16_t len, uint8_t idx);
/***************at only for test end**********************/
uint8_t aoa_at_handle_bbeatnow(void);
uint8_t aoa_send_response(uint8_t *data, uint16_t len);
uint8_t get_zdevice_battery(void);
uint8_t test_begin(uint8_t *data, uint16_t len, uint8_t idx);
uint8_t aoa_at_handle_close_bdev_report(uint8_t *data, uint16_t len, uint8_t idx);
void save_dev_addd_nv(void);
extern uint8_t send_wl_temp[100][15];
extern uint8_t save_flas;
uint8_t task_flag_start =0;
struct zdevice_setting zdev_set;
uint8_t flag_airmod =0x00;
	uint8_t taskidnum; 
	uint8_t group_num_data =0;
uint8_t bbind_num =0;

uint8_t get_bdev_group_num(void)
{
		if((zdev_set.isMdev == 0) || (zdev_set.isMdev == 1))
			group_num_data = (bbind_num /BDEVICE_GROUP_NUM) +1;
		else
			group_num_data = (bbind_num /BDEVICE_GROUP_NUM) +11;
		
  return group_num_data;
}
	
static const aoa_at_handle_symbol aoa_at_table[SUPPORT_AT_NUM] = {
	{test_begin,(uint8_t *)"AT+START="},
	{aoa_at_handle_zsaveb, (uint8_t *)"AT+ZSAVEB="},
	{aoa_at_handle_network, (uint8_t *)"AT+NETWORK="},
	{aoa_at_handle_zcall, (uint8_t *)"AT+ZCALL?"},
	{aoa_at_handle_zbeat, (uint8_t *)"AT+ZBEAT?"},
	{aoa_at_handle_zbind, (uint8_t *)"AT+ZBIND="},	
	{aoa_at_handle_zupdate, (uint8_t *)"AT+ZUPDATE="},
	{aoa_at_handle_rdsspower, (uint8_t *)"AT+RDSSPOWER="},
	{aoa_at_handle_rnsspower, (uint8_t *)"AT+RNSSPOWER="},
	{aoa_at_handle_airplanemode, (uint8_t *)"AT+AIRPLANEMODE="},
	{aoa_at_handle_zlocation, (uint8_t *)"AT+ZLOCATION?"},
	//{aoa_at_handle_bbroadcast, (uint8_t *)"AT+BBROADCAST?"},
	//{aoa_at_handle_bcall, (uint8_t *)"AT+BCALL="},
	{aoa_at_handle_bbind, (uint8_t *)"AT+BBIND="},
	{aoa_at_handle_bunbind, (uint8_t *)"AT+BUNBIND="},
	{aoa_at_handle_bbeat, (uint8_t *)"AT+BBEAT="},
	{aoa_at_handle_binfowrite, (uint8_t *)"AT+BINFOWRITE="},
	{aoa_at_handle_bbbeat, (uint8_t *)"AT+BBBEAT="},
	{aoa_at_handle_blight, (uint8_t *)"AT+BLIGHT="},
	{aoa_at_handle_binfoerase, (uint8_t *)"AT+BINFOERASE="},
	{aoa_at_handle_centeraddress, (uint8_t *)"AT+CENTERADDRESS="},
	{aoa_at_handle_bsosinfo, (uint8_t *)"AT+BSOSINFO="},
	{aoa_at_handle_bsos, (uint8_t *)"AT+BSOS="},
//	{aoa_at_handle_selfcheck, (uint8_t *)"AT+SELFCHECK?"},
	{aoa_at_handle_bdistance, (uint8_t *)"AT+BDISTANCE="},
	{aoa_at_handle_blowbattery, (uint8_t *)"AT+BLOWBATTERY="},
	{aoa_at_handle_zreportloctime, (uint8_t *)"AT+ZREPORTLOCTIME="},
	{aoa_at_handle_breportinfotime, (uint8_t *)"AT+BREPORTINFOTIME="},
	//{aoa_at_handle_taskover, (uint8_t *)"AT+TASKOVER?"},
	{aoa_at_handle_bboxunlock, (uint8_t *)"AT+BBOXUNLOCK="},
	{aoa_at_handle_close_bdev_report,(uint8_t *)"AT+WARINGSTATUS="},
/***************at only for test start**********************/
	//{aoa_at_handle_rdmsg, (uint8_t *)"AT+RDMSG="},
/***************at only for test end**********************/

