sunmny/z1/z1-stm32l476/Src/APP/app_aoa.c
};
//AT+NETWORK=107890,107891##
uint8_t aoa_at_handle_network(uint8_t *data, uint16_t len, uint8_t idx)
{
				uint8_t lenth = 0;
				uint8_t temp1[6],temp[6];
				uint8_t temp3[12];
				uint8_t back_buf[13];
			  //printf("zdev_set.mydev_id = %s \r\n",zdev_set.mydev_id);
	
				lenth = strlen("AT+NETWORK=");
	
		
				memcpy(back_buf,"+NETWORK:OK##",13);
	
				memcpy(temp,&data[lenth],6);		
				memcpy(temp1,&data[lenth+7],6);
				memcpy(temp3,"10123456",8);
				memcpy(&temp3[8],&temp[2],4);
	
				//zdev_set.mydev_id
		if((temp1[0]=='1')&&temp1[1] == '0'){
			printf("zdev_set.mydev_id = %s \r\n",zdev_set.mydev_id);
	
		    if(0 == memcmp(zdev_set.mydev_id,temp3,12)){
						zdev_set.isMdev =1;  //zhu
						memcpy(zdev_set.other_id,"10123456",8);
						memcpy(&zdev_set.other_id[8],&temp1[2],4);
						//printf("zdev_set.mydev_id = %s \r\n",zdev_set.mydev_id);
	
				}else{
					zdev_set.isMdev = 2; // cong
					memcpy(zdev_set.other_id,"10123456",8);
					memcpy(&zdev_set.other_id[8],&temp[2],4);
				}
					zdev_set.zdev_num = 2;
			}else {
			
			/********* only one z1 *********/
					zdev_set.zdev_num = 1;
				
			    zdev_set.isMdev =0;		
			
			}
			printf("zdev_set.mydev_id = %s \r\n",zdev_set.mydev_id);
			printf("zdev_set.other_id = %s \r\n",zdev_set.other_id);
			printf("zdev_set.zdev_num = %d \r\n",zdev_set.zdev_num);
		aoa_send_response(back_buf,13);
}

uint8_t save_data_type=0;

uint8_t  get_save_data_type(void)
{

	return save_data_type;
}

uint8_t set_save_data_type(uint8_t data_type)
{

	 save_data_type = data_type;
	
}
extern TaskHandle_t devsavetask;
void send_to_save(void)
{

	 xTaskNotifyGive( devsavetask );

}

void save_dev_addr(void)
{
		set_save_data_type(0xf0);
		send_to_save();
}

void save_dev_info(void)
{
		set_save_data_type(0xe0);
		send_to_save();
}

void save_dev_info_flash(void)
{

   set_nvram_save_data(save_nv_buf);
}
void devinfo_save_task(void const * argument)
{
	
	
	uint8_t cmd = 0xff;
	
		while(1){
			printf("save task info start  \r\n");
			osDelay(5000);
			 	save_dev_addd_nv();
			printf("save task info ok  \r\n");
			#if 0
				ulTaskNotifyTake( pdTRUE, portMAX_DELAY);
			
				cmd = get_save_data_type();
				printf("save task cmd %x \r\n",cmd);
			switch(cmd){
				case 0xf0:
					printf("save task addr start  \r\n");
				    save_dev_addd_nv();
							printf("save task addr ok  \r\n");
					break;
				case 0xe0:
					printf("save task info start  \r\n");
					  save_dev_info_flash();
						printf("save task info ok  \r\n");
					break;
				
				default:
					break;
				
				  }
		#endif
		}



}


void aoa_at_handle_bsossend(void)
{
		uint8_t report_stat[30];
		uint8_t len;
		
		len = strlen("+BSOSSEND:");
	
		memcpy(report_stat,"+BSOSSEND:", len);
		
		memcpy(&report_stat[len],zdev_set.mydev_id,12);
		len+=12;
		memcpy(&report_stat[len],",",1);
		len +=1;

		report_stat[len] = zdev_set.report_mesage_id + '0';
		len +=1;
		
		memcpy(&report_stat[len],aoa_at_end_tok,4);
		
		len+=4;
	
		aoa_send_response(report_stat,len);
		//task_aoauart_mail_put(report_stat,len);
}




uint8_t report_charing_buf[33];
uint8_t bat_temp_buf[21];
uint8_t first_bat_soc =0;

uint8_t report_charing_soc(void)
{
	memcpy(report_charing_buf,"Charging:",9);
	memset(bat_temp_buf,0x00,21);
	
	bat_temp_buf[0] =0x15;
	bat_temp_buf[1] = 0x08;
	bat_temp_buf[2] = 0xef;
	
	if(!first_bat_soc){
	    first_bat_soc = 1;
	}else{
			if(	zdev_set.zbat_soc_bak > zdev_set.zbat_soc){
					if((zdev_set.zbat_soc_bak - zdev_set.zbat_soc) >2)
							zdev_set.zbat_soc = zdev_set.zbat_soc_bak;
			}else{
					if((zdev_set.zbat_soc - zdev_set.zbat_soc_bak) >2)
						zdev_set.zbat_soc = zdev_set.zbat_soc_bak;;
			
			}
	
			if(	zdev_set.zbat_soc1_bak > zdev_set.zbat_soc1){
					if((zdev_set.zbat_soc1_bak - zdev_set.zbat_soc1) >2)
							zdev_set.zbat_soc1 = zdev_set.zbat_soc1_bak;
			}else{
					if((zdev_set.zbat_soc1 - zdev_set.zbat_soc1_bak) >2)
						zdev_set.zbat_soc1 = zdev_set.zbat_soc1_bak;;
			
			}
	}
	
	if(zdev_set.zbattery !=0){
	
			bat_temp_buf[5] = zdev_set.zbat_soc <<4 | zdev_set.zbat_soc1 ;
	}else{

		  bat_temp_buf[5] = zdev_set.zbat_soc <<4 | 0x0f;
	}

	bat_temp_buf[20] = zdev_set.bat_chr_status << 4  | zdev_set.bat1_chr_status;
	memcpy(&report_charing_buf[9],bat_temp_buf,21);
	
		memcpy(&report_charing_buf[30],"##",2);
	
	zdev_set.zbat_soc_bak = zdev_set.zbat_soc;
	zdev_set.zbat_soc1_bak = zdev_set.zbat_soc1;
	
	if(0 == task_flag_start)
			ble_send_response(report_charing_buf,32);
}
extern uint8_t version_info[10];
uint8_t aoa_at_handle_bbeatnow(void)
{
		uint8_t  report_stat[70];
	//	uint8_t report_location[80];
		uint8_t len,lenth;
		//get_zdevice_battery();
		len = strlen("+BBEATNOW:");
	  set_val_to_report();
	  set_val1_to_report();
		memcpy(report_stat,"+BBEATNOW:",len);
		memcpy(&report_stat[len],",",1);
		len+=1;
		//memcpy(zdev_set.mydev_id,"101122334455",12);  //sunmny for test 0604
		if(zdev_set.mydev_id[0] != '1'){
					return 1;
		}
		memcpy(&report_stat[len],zdev_set.mydev_id,12);
		len+=12;
		memcpy(&report_stat[len],",",1);
		len+=1;
		if(zdev_set.zbattery == 1){
			memcpy(&report_stat[len],"OK,",3);
			len+=3;
		}else {
			memcpy(&report_stat[len],"ERROR",5);
			len+=5;
			//memcpy(&report_stat[len],"OK,",3);
			//len+=3;
		}
		//if(zdev_set.status.zrd_test_status ==0){
			//	memcpy(&report_stat[len]," RD",3);
		//	len+=3;
	//	}
		//if(zdev_set.status.zrn_test_status ==0){
			//	memcpy(&report_stat[len]," RN",3);
			//len+=3;
		//}
		if(zdev_set.zbattery ==0){
			memcpy(&report_stat[len]," RD",3);
			len+=3;
				memcpy(&report_stat[len]," EF",3);
			len+=3;
			memcpy(&report_stat[len],",",1);
		  len+=1;
		}
		
		//memcpy(&report_stat[len],",",1);
		//len+=1;
		

		memcpy(&report_stat[len],",",1);
		len+=1;
		//memcpy(&report_stat[len],); zdev_set.zbat_soc +'0';
		//len+=1;
		if(zdev_set.zbat_soc == 0){
				memcpy(&report_stat[len],"0",1);
				len+=1;
		}else if(zdev_set.zbat_soc == 1){
				memcpy(&report_stat[len],"1",1);
				len+=1;
		}else if(zdev_set.zbat_soc == 2){
				memcpy(&report_stat[len],"2",1);
				len+=1;
		}else if(zdev_set.zbat_soc == 3){
			memcpy(&report_stat[len],"3",1);
				len+=1;
		
		}else if(zdev_set.zbat_soc == 4){
			memcpy(&report_stat[len],"4",1);
				len+=1;
		
		
		}else {
			memcpy(&report_stat[len],"F",1);
				len+=1;
		
