sunmny/z1/z1-stm32l476/Src/APP/app_aoa.c
		}
		memcpy(&report_stat[len],",",1);
		len+=1;
		if(zdev_set.zbattery ==0){
			memcpy(&report_stat[len],"F",1);
				len+=1;	
	}else{
			if(zdev_set.zbat_soc1 == 0){
				memcpy(&report_stat[len],"0",1);
				len+=1;
		}else if(zdev_set.zbat_soc1 == 1){
				memcpy(&report_stat[len],"1",1);
				len+=1;
		}else if(zdev_set.zbat_soc1 == 2){
				memcpy(&report_stat[len],"2",1);
				len+=1;
		}else if(zdev_set.zbat_soc1 == 3){
			memcpy(&report_stat[len],"3",1);
				len+=1;
		
		}else if(zdev_set.zbat_soc1 == 4){
			memcpy(&report_stat[len],"4",1);
				len+=1;
		
		
		}
	
		}
		memcpy(&report_stat[len],",",1);
		len+=1;
		
		memcpy(&report_stat[len],"ON,",3);
			len+=3;
		
		
	if(zdev_set.zbattery ==0){
		memcpy(&report_stat[len],"OFF,",4);
			len+=4;
	}else{
			memcpy(&report_stat[len],"ON,",3);
			len+=3;
		}
		
		memcpy(&report_stat[len],",,,",3);
		len+=3;
		
		
		memcpy(&report_stat[len],version_info,8);
		len = len+8;
		
		memcpy(&report_stat[len],aoa_at_end_tok,4);
			len+=AT_END_TOK_LEN;

	 aoa_send_response(report_stat,len);
//		printf("bbreport : %s \r\n",report_stat);
		
		//task_aoauart_mail_put(report_stat,len);
}

uint8_t  light_flag = 0;
uint8_t  report_dis_buf[12] = {0};
//uint8_t  report_lenth[2]="99";
void aoa_at_handle_bpalert(void);
extern uint8_t contiue_task;
 
uint8_t aoa_at_handle_bbeatnow_bdev(uint8_t *report_id,uint8_t *report_info)
{
		uint8_t  report_stat[70];
			
		uint8_t len,lenth;
		len = strlen("+BBEATNOW:");	
		memcpy(report_stat,"+BBEATNOW:",len);
	
		memcpy(&report_stat[len],"1",1);
		len+=1;
		memcpy(&report_stat[len],",",1);
		len+=1;
		//memcpy(zdev_set.mydev_id,"101122334455",12);  //sunmny for test 0604
		if(report_id[0] != '1')
		{
				return 1;
		}
			memcpy(&report_stat[len],report_id,12);
		  memcpy(report_dis_buf,report_id,12);
		
		len+=12;
	
		memcpy(&report_stat[len],",",1);
		len+=1;
		if(report_info[6] =='1'&&report_info[7]=='1'&&report_info[8]=='1'){
			memcpy(&report_stat[len],"OK,",3);
			len+=3;
		}else {
			memcpy(&report_stat[len],"OK,",3);
			len+=3;
		}
	//	if(zdev_set.status.zrd_test_status ==0){
			//	memcpy(&report_stat[len]," RD",3);
		//	len+=3;
	//	}
		//if(zdev_set.status.zrn_test_status ==0){
			//	memcpy(&report_stat[len]," RN",3);
			//len+=3;
		//}
		//memcpy(&report_stat[len],",",1);
		//len+=1;
			//if((zdev_set.isMdev ==1)){
				//	memcpy(&report_stat[len],"10",2);
					//memcpy(&report_stat[len],"02",2);
					//memcpy(report_lenth,report_info,2);
				//	len +=2;
			//}else{
				//	memcpy(&report_stat[len],"10",2);
				//memcpy(&report_stat[len],"02",2);
					//memcpy(report_lenth,report_info,2);
				//	len +=2;
			
		//	}
			
			
				if((zdev_set.isMdev ==1)){
					memcpy(&report_stat[len],&report_info[1],2);
					//memcpy(report_lenth,report_info,2);
					len +=2;
			}else{
					memcpy(&report_stat[len],&report_info[3],2);
				//	memcpy(report_lenth,report_info,2);
					len +=2;
			
			}
		
		
		memcpy(&report_stat[len],",",1);
		len+=1;
		//memcpy(&report_stat[len],); zdev_set.zbat_soc +'0';
		//len+=1;
		if(report_info[5] == '0'){
				memcpy(&report_stat[len],"0",1);
				len+=1;
		}else if(report_info[5] == '1'){
				memcpy(&report_stat[len],"1",1);
				len+=1;
		}else if(report_info[5] == '2'){
				memcpy(&report_stat[len],"2",1);
				len+=1;
		}else if(report_info[5] == '3'){
			memcpy(&report_stat[len],"3",1);
				len+=1;
		
		}else if(report_info[5] == '4'){
			memcpy(&report_stat[len],"4",1);
				len+=1;	
		}else {
			memcpy(&report_stat[len],"F",1);
				len+=1;	
		}
		memcpy(&report_stat[len],",",1);
		len+=1;
/*******	状态改成开和关******/
			if(report_info[6] =='1'){
			 memcpy(&report_stat[len],"ON,",3);
				len+=3;
			}else if(report_info[6] =='0'){
			 memcpy(&report_stat[len],"OFF,",4);
				len+=4;
			
			}
			//else if(report_info[6] =='2'){
				//memcpy(&report_stat[len],"OFF,",4);
				//len+=4;
			//}
		
		if(report_info[7] =='1'){
		
		memcpy(&report_stat[len],"ON,",3);
			len+=3;
		}else{
		memcpy(&report_stat[len],"OFF,",4);
			len+=4;
		}
		if(report_info[8] =='1'){
			memcpy(&report_stat[len],"1",1);
			}else {
			memcpy(&report_stat[len],"0",1);
			}
		len+=1;
		
		memcpy(&report_stat[len],",",1);
		len+=1;
		if(report_info[19] =='0 '){
		memcpy(&report_stat[len],"OFF,",4);
		len+=4;
		}else{
		memcpy(&report_stat[len],"ON,",3);
		len+=3;
		}
		
		if(light_flag == 0){
		memcpy(&report_stat[len],"OFF",3);
		len+=3;
		}else if(light_flag ==1){
		memcpy(&report_stat[len],"ON",2);
		len+=2;
		}
//BDINFO:112019060441,0000031111000015500000##	
		memcpy(&report_stat[len],",",1);
		len = len+1;
		
		memcpy(&report_stat[len],"20",2);
		len = len+2;
		
	
			memcpy(&report_stat[len],&report_info[10],6);
		
		len+=6;
		
		memcpy(&report_stat[len],aoa_at_end_tok,4);
			len+=AT_END_TOK_LEN;
		//printf("report_stat:%s  %d \r\n",report_stat,len);
	 aoa_send_response(report_stat,len);
	//	printf("aoa bdev send -------------------\r\n");
		
		//task_aoauart_mail_put(report_stat,len);
}

void aoa_at_handle_bpalert(void)
{
		uint8_t  report_stat[30];
		//uint8_t report_location[60];
		uint8_t len,lenth;
		//get_zdevice_battery();
		len = strlen("+BPALERT:");

		memcpy(report_stat,"+BPALERT:",len);

		if(zdev_set.mydev_id[0] != '1'){
				return ;
		}
		memcpy(&report_stat[len],zdev_set.mydev_id,12);  //sunmny for test 0604
		len+=12;
		memcpy(&report_stat[len],",",1);
		len+=1;
		
		
		memcpy(&report_stat[len],"2",1);
		len+=1;
		
		memcpy(&report_stat[len],",",1);
		len+=1;
		
		report_stat[len] = zdev_set.zbat_soc + '0';
			len = len+1;
		
		memcpy(&report_stat[len],",",1);
			len+=1;
		if(zdev_set.zbattery ==1){
				report_stat[len] = zdev_set.zbat_soc1 + '0';
			  len+=1;
		}else{
		
			report_stat[len] =  'F';
			len+=1;
			
		}
			
			memcpy(&report_stat[len],aoa_at_end_tok,4);
			len+=AT_END_TOK_LEN;
	if(zdev_set.zbattery ==1){
	//	printf("zdev_set.report_bat_threshold = %d  soc :%d  soc1:%d ",zdev_set.report_bat_threshold,zdev_set.zbat_soc,zdev_set.zbat_soc1);
			if(zdev_set.zbat_soc1<=zdev_set.report_bat_threshold || zdev_set.zbat_soc<=zdev_set.report_bat_threshold ){
			//	printf("IN zdev_set.report_bat_threshold = %d  soc :%d  soc1:%d ",zdev_set.report_bat_threshold,zdev_set.zbat_soc,zdev_set.zbat_soc1);
	   aoa_send_response(report_stat,len);
		} 
	}else{
	//printf("zdev_set.report_bat_threshold = %d  soc :%d  soc1:%d ",zdev_set.report_bat_threshold,zdev_set.zbat_soc,zdev_set.zbat_soc1);
			if( zdev_set.zbat_soc<=zdev_set.report_bat_threshold ){
		//	printf("IN zdev_set.report_bat_threshold = %d  soc :%d  soc1:%d ",zdev_set.report_bat_threshold,zdev_set.zbat_soc,zdev_set.zbat_soc1);
	   aoa_send_response(report_stat,len);
		} 
	
