sunmny/z1/z1-stm32l476/Src/APP/app_aoa.c
		}
	



	//	task_aoauart_mail_put(report_stat,len);
}

void BatTimerCallback(void)
{
			set_val1_to_report();
			set_val_to_report();
			report_charing_soc();
}
uint8_t timer_send_count= 0;

extern uint8_t airmod_flag ;






uint8_t aoa_at_handle_taskbegin(uint8_t *data, uint16_t len, uint8_t idx)
{
			
}



/*todo, 20181113*/
void get_zdevice_id(uint8_t *data)
{
	//uint8_t* p="123456789012";  //需要修改获取不到id 返回error 0418
	//memcpy(data,p,DEVICE_ID_LEN);
		memcpy(data,zdev_set.mydev_id,DEVICE_ID_LEN);
}

void add_separator_comma(uint8_t *data)
{
		*data=',';
}


/*todo, 20181113*/
uint8_t get_zdevice_battery(void)
{
	uint16_t bat_soc;
	
	//zdev_read_battery_soc(&bat_soc);
		zdev_set.zbat_soc =3;
	
		return 3;
	
	if(bat_soc >=80 && bat_soc <100){
		printf("retrun 4 \r\n");
		return 4;
	}
	else if(bat_soc >=60&&bat_soc <80 )
				return 3;
	else if(bat_soc >=40 && bat_soc <60)
				return 2;
	else if(bat_soc >=20 && bat_soc <40)
				return 1;
	else if(bat_soc >0 && bat_soc <20)
			 return 0;
	
}

/*todo, 20181113*/
uint8_t get_ble_rssi(void)
{
	return 0;
}


uint8_t aoa_send_response(uint8_t *data, uint16_t len)
{
	return hw_uart1_send(data,len);
}

uint8_t make_zdevice_okerror_response(uint8_t is_id_need, uint8_t is_errno_need, 
											uint8_t result, uint8_t at_index)
{
	uint16_t totallen=0,len=0;
	uint8_t   deviceid[DEVICE_ID_LEN];
	uint8_t response[64];

	//len=strlen(aoa_at_respone_table[at_index].pData);
	//memcpy(&response[totallen],aoa_at_respone_table[at_index].pData,len);
	//totallen+=len;

	if(is_id_need)
	{
		get_zdevice_id(deviceid);
		len=DEVICE_ID_LEN;
		memcpy(&response[totallen],deviceid,len);
		totallen+=len;
	
	len=1;
	add_separator_comma(&response[totallen]);
	totallen+=len;

	}


	if(result==0)
	{
		len=2;
		memcpy(&response[totallen],"OK",len);
		totallen+=len;
	}
	else/*to do, error number needed? 20181113*/
	{
		uint8_t buf[10];
		len=5;
		memcpy(&response[totallen],"ERROR",len);
		totallen+=len;

		if(is_errno_need)
		{
			len=1;
			add_separator_comma(&response[totallen]);
			totallen+=len;
			
			int2str(result, buf);
			len=strlen(buf);
			memcpy(&response[totallen],buf,len);
			totallen+=len;
		}
	}

	len=AT_END_TOK_LEN;
	memcpy(&response[totallen],aoa_at_end_tok,len);
	totallen+=AT_END_TOK_LEN;

	return aoa_send_response(response,totallen);
}


/*
AT+ZBEAT?
+ZBEAT:101234567890123,1,2,2
*/
uint16_t make_zbeat_response(uint8_t *response)
{
	uint16_t totallen=0,len=0;
	uint8_t data;
	
	len=strlen("+ZBEAT:");
	memcpy(response,"+ZBEAT:",len);
	totallen+=len;
	
	get_zdevice_id(&response[totallen]);
	totallen+=DEVICE_ID_LEN;
	
	add_separator_comma(&response[totallen]);
	totallen+=1;
	
	data=get_zdevice_battery();
	if(data<0 || data>4)
	{
	response[totallen]='F';
	}else{
	response[totallen]=data+0x30;
	}
	totallen+=1;
	
	add_separator_comma(&response[totallen]);
	totallen+=1;
	
	data=get_rd_rssi();
	if(data<0 || data>4){
	response[totallen]='F';
	}else{
	response[totallen]=data+0x30;
	}
	totallen+=1;
	
	//add_separator_comma(&response[totallen]);
//	totallen+=1;
	
	//data=get_ble_rssi();
	//response[totallen]=data+0x30;
	//totallen+=1;
	
	memcpy(&response[totallen],aoa_at_end_tok,AT_END_TOK_LEN);
	totallen+=AT_END_TOK_LEN;

	return totallen;
}

uint8_t add_ok_data(uint8_t *response)
{



}
uint16_t make_zcall_response(uint8_t *response)
{
	uint16_t totallen=0,len=0;
	uint8_t data;
	
	len=strlen("+ZCALL:");
	memcpy(response,"+ZCALL:",len);
	totallen+=len;
	
	#if 1
	get_zdevice_id(&response[totallen]);
	totallen+=DEVICE_ID_LEN;
	
	add_separator_comma(&response[totallen]);
	totallen+=1;
	
	
	memcpy(&response[totallen],"OK",2);
	totallen +=2;
	#endif  //需要修改返回值
	//memcpy(&response[totallen],"ERROR",5);
	//totallen +=5;
	
	memcpy(&response[totallen],aoa_at_end_tok,AT_END_TOK_LEN);
	totallen+=AT_END_TOK_LEN;

	return totallen;
}
//sunmny
uint16_t make_zsave_response(uint8_t *response)
{
	uint16_t totallen=0,len=0;
	uint8_t data;
	
	len=strlen("+ZSAVEB:");
	memcpy(response,"+ZSAVEB:",len);
	totallen+=len;
	
	//get_zdevice_id(&response[totallen]);
	//totallen+=DEVICE_ID_LEN;
	

	
	memcpy(&response[totallen],aoa_at_end_tok,AT_END_TOK_LEN);
	totallen+=AT_END_TOK_LEN;

	return totallen;
}
uint16_t make_zupdate_response(uint8_t *response)
{
	
	return 0;
}
uint16_t make_zbind_response(uint8_t *response)
{
	uint16_t totallen=0,len=0;
	uint8_t data;
	
	if(zdev_set.zdev_is_set){
	len=strlen("+ZBIND:OK");
	memcpy(response,"+ZBIND:OK",len);
	totallen+=len;
	}else if (zdev_set.zdev_is_set == 0){
	
	len=strlen("+ZBIND:ERROR");
	memcpy(response,"+ZBIND:ERROR",len);
	totallen+=len;
	}
	
	memcpy(&response[totallen],aoa_at_end_tok,AT_END_TOK_LEN);
	totallen+=AT_END_TOK_LEN;

	return totallen;
}
uint8_t get_zdevice_num(uint8_t *data,uint16_t len,uint8_t idx)
{
			uint8_t lenth = 0;
			uint8_t zd_num;
	
			lenth = strlen(aoa_at_table[idx].pData);
			if(data[lenth] == '2')
					return 2;
			else if(data[lenth] == '1')
					return 1;
			
}
//AT+ZBIND=2,234567890123,101234567890124
uint8_t test_buf[12];
uint8_t get_param_count(uint8_t *data,uint16_t len,uint8_t idx)
{
		uint8_t count ;
		uint8_t par_count =0;
	
			while(data[count]){
				if(data[count] == ',')
						par_count ++;
				
					count ++;
			}


}
extern uint8_t save_nv_buf[70];
uint8_t get_zdev_id(uint8_t *data , uint16_t len ,uint8_t idx)
{
		uint8_t head_len = 0,i=0,end_count = 0;
		uint8_t count = 0,par_count =0,temp_count[20];
		head_len = strlen("AT+ZBIND");
		count = head_len;
	
		while((data[count+1]!='#')&&(data[count+2]!='#')){
					if(data[count] == '=' || data[count] ==','){
							temp_count[par_count] = count;
							par_count ++;
					}
					count++;
		}
		end_count = count;
		
		printf("par_count = %d \r\n ",par_count);
		
		for(i =0;i<12;i++){
			//	printf("temp_count[%d] = %d \r\n ",i,temp_count[i]);
							switch(i){
								case 0:
										if(temp_count[1] -temp_count[0] ==1)
												//save_nv_buf[4] = data[temp_count[1]-1];
												zdev_set.zdev_num = 1;//data[temp_count[1]-1] - '0';
//												printf("zdev_set.zdev_num = %d \r\n",zdev_set.zdev_num);
									break;
								case 1:
											if(temp_count[2] -temp_count[1] >1){
												
													memcpy(zdev_set.other_id,&data[temp_count[1]+1],12);
													//memcpy(&save_nv_buf[5],zdev_set.other_id,12);
//												printf("zdev_set.other_id = %s\r\n",zdev_set.other_id);
											}
									break;
								case 2:
											//	memcpy(zdev_set.rn_num,&data[temp_count[i]+1],(temp_count[i+1] - temp_count[i] -1));
												//memcpy(&save_nv_buf[10],&data[temp_count[i]+1],6);
											//	printf("zdev_set.rn_num = %s\r\n",zdev_set.rn_num);
									break;
								case 3:
										//	memcpy(zdev_set.rd_num,&data[temp_count[i]+1],(temp_count[i+1] - temp_count[i] -1));
											// memcpy(&save_nv_buf[16],&data[temp_count[i]+1],6);
											//	printf("zdev_set.rd_num = %s\r\n",zdev_set.rd_num);
									break;
								case 4:
										//	memcpy(zdev_set.report_mesage_id,&data[temp_count[i]+1],(temp_count[i] - temp_count[i-1] -1));
											//zdev_set.report_mesage_id = data[temp_count[i]+1] - '0';
											//save_nv_buf[22]=zdev_set.report_mesage_id +'0';
//												printf("zdev_set.report_mesage_id = %d\r\n",zdev_set.report_mesage_id);
							//	printf("save_nv_buf %s\r\n",save_nv_buf);
									break;
								case 5:
									//	memcpy(zdev_set.zdev_report_time,&data[temp_count[i]+1],(temp_count[i+1] - temp_count[i] -1));
//									printf("(zdev_set.zdev_report_time = %s\r\n",zdev_set.zdev_report_time);	
									break;
								case 6:
//									printf("zdev_set.bdev_report_time = %d %d\r\n",temp_count[i+1], temp_count[i]);
								//	memcpy(zdev_set.bdev_report_time,&data[temp_count[i]+1],(temp_count[i+1] - temp_count[i] -1));
//												printf("zdev_set.bdev_report_time = %s\r\n",zdev_set.bdev_report_time);
									break;
								case 7:
									//memcpy(zdev_set.report_ip,&data[temp_count[i]+1],(temp_count[i+1] - temp_count[i] -1));
//												printf("zdev_set.report_ip = %s\r\n",zdev_set.report_ip);
									break;
								case 8:
									//memcpy(zdev_set.report_port,&data[temp_count[i]+1],(temp_count[i+1] - temp_count[i] -1));
//												printf("zdev_set.report_port = %s\r\n",zdev_set.report_port);
									break;
								
								case 9:
									//memcpy(zdev_set.report_apn,&data[temp_count[i]+1],(temp_count[i+1] - temp_count[i] -1));
//												printf("zdev_set.report_apn = %s\r\n",zdev_set.report_apn);
									break;
							case 10:
									//memcpy(zdev_set.user_name,&data[temp_count[i]+1],(temp_count[i+1] - temp_count[i] -1));
//												printf("zdev_set.user_name = %s\r\n",zdev_set.user_name);
									break;
							
							case 11:
									//memcpy(zdev_set.user_paswd,&data[temp_count[i]+1],end_count -temp_count[i] +1);
//												printf("zdev_set.user_paswd = %s\r\n",zdev_set.user_paswd);
									break;
						
