sunmny/z1/z1-stm32l476/Src/APP/app_aoa.c
								defualt:
									break;
							
							
							
							}
		
		}
	 
	zdev_set.zdev_is_set =1;
	
		#if 0
		while(data[count++]){
			if(data[count] == ','){
						par_count ++;
			
			
			if(par_count == 1){
					if(data[count -1] != '=' && data[count-1] != '1'){
						printf("count1 = %d\r\n",count);
						memcpy(zdev_set.other_id,&data[count+1],DEVICE_ID_LEN);
						
					}
			}else if(par_count == 2){
						printf("count2 = %d\r\n",count);
				
						temp_count = count;
			}
			else if(par_count == 3){
				printf("count3 = %d\r\n",count);
				memcpy(zdev_set.rn_num,&data[temp_count+1],6);
				temp_count = count;
				printf("rn_num %s \r\n",zdev_set.rn_num);		
			}
				else if(par_count ==4){
					printf("count4 = %d\r\n",count);
					memcpy(zdev_set.rd_num,&data[temp_count+1],6);
					temp_count = count;
					printf("rd_num %s \r\n",zdev_set.rd_num);	
						
				}else if(par_count == 5){
						zdev_set.report_mesage_id = data[temp_count+1] - '0';
						temp_count = count;
				}else if(par_count == 6){
						#if 0
						if((count-(temp_count+1)) == 1){
									zdev_set.zdev_report_time = data[temp_count+1] -'0';
						}else if((count -(temp_count +1)) == 2){
						
									zdev_set.zdev_report_time = (data[temp_count+1] -'0')*10 + (data[temp_count+2] -'0');
						
						}else if((count -(temp_count+1) ==3) ){
										zdev_set.zdev_report_time = (data[temp_count+1] -'0')*100 + ((data[temp_count+2] -'0')*10)\
								+(data[temp_count+3] -'0');
						}
						#endif
						memset(zdev_set.zdev_report_time,0x00,4);
						memcpy(zdev_set.zdev_report_time, &data[temp_count +1],count-(temp_count+1));
						temp_count = count;
				}else if(par_count == 7){
				#if 0
				if((count-(temp_count+1)) == 1){
									zdev_set.bdev_report_time = data[temp_count+1] -'0';
						}else if((count -(temp_count +1)) == 2){
						
									zdev_set.bdev_report_time = (data[temp_count+1] -'0')*10 + (data[temp_count+2] -'0');
						
						}else if((count -(temp_count+1) ==3) ){
										zdev_set.bdev_report_time = (data[temp_count+1] -'0')*100 + ((data[temp_count+2] -'0')*10)\
								+(data[temp_count+3] -'0');
						}
						#endif
						memset(zdev_set.bdev_report_time,0x00,4);
						memcpy(zdev_set.bdev_report_time, &data[temp_count +1],count-(temp_count+1));
						temp_count = count;
				}else if(par_count == 8){
				
//				memcpy(zdev_set.report_ip, &data[temp_count +1],count-(temp_count+1));
					temp_count = count ;
					
				}else if(par_count == 9){
					memset(zdev_set.report_port,0x00,8);
					printf("ssreprot = %c \r\n",data[temp_count +1]);
					printf("ssreprot = %c \r\n",data[temp_count +2]);
					printf("ssreprot = %c \r\n",data[temp_count +3]);
					printf("ssreprot = %c \r\n",data[temp_count +4]);
					memcpy(&zdev_set.report_port[0],&data[temp_count +1],4);
					printf("ssreprot = %s \r\n",zdev_set.report_port);
					temp_count = count ;
				
				}else if(par_count == 10){
				
//					memcpy(zdev_set.report_apn, &data[temp_count +1],count-(temp_count+1));
					temp_count = count ;
				
				
				}else if(par_count == 11){
				
					memcpy(zdev_set.user_name, &data[temp_count +1],count-(temp_count+1));
					temp_count = count ;
				}else if(par_count == 12){
				
				memcpy(zdev_set.user_paswd, &data[temp_count +1],count-(temp_count+1));
					temp_count = count ;
				
				}
			
				zdev_set.zdev_is_set =1;
		}else{
			
				if((data[count] == '#')&&(data[count+1] =='#')&&(data[count+2] ==0x0d)&&(data[count+3] == 0x0a)){
					memcpy(zdev_set.user_paswd, &data[temp_count +1],count-(temp_count+1));
					break;
				}else
						continue;
		}
			
		
	}
	#endif		
}
uint8_t aoa_at_handle_zupdate(uint8_t *data, uint16_t len, uint8_t idx) //需要修改返回值 
{
	uint16_t totallen;

	uint8_t zdev_id[12];
	
	uint8_t response[64];
	

	
	totallen=make_zupdate_response(response);
	return aoa_send_response(response,totallen);
}
uint8_t aoa_at_handle_zbind(uint8_t *data, uint16_t len, uint8_t idx)
{
	uint16_t totallen;
	uint8_t ret;
	uint8_t response[64];
	
	//task_flag_start =1;
		//zdev_set.zdev_num = 1;//get_zdevice_num(data,len,idx);
	
	//get_zdev_id(data,len,idx);

		memcpy(response,"+ZBIND:OK",9);
		memcpy(&response[9],aoa_at_end_tok,4);
	//totallen=make_zbind_response(response);
	 aoa_send_response(response,13);
	return 0;
}

void send_getid_zdev(uint8_t *buf,uint8_t len)
{
	
		ble_send_response(buf,len);


}

extern uint8_t bleisok ;
extern uint8_t gsn_buf[12];
extern uint8_t zdev_isbind;

uint8_t zcall_lenth;
uint8_t aoa_at_handle_zcall(uint8_t *data, uint16_t len, uint8_t idx)
{
	uint16_t totallen;
	
	uint8_t buf[12];
		//uint8_t zcall_response[64];
	memcpy(buf,"versionget##",12);
	
	ble_send_response(buf,12);
	//osDelay(1000);
  //printf("bleisok = %d \r\n",bleisok);
	//if(bleisok == 0){
		//	memcpy(zcall_response,"+ZCALL:ERROR",12);
		//	memcpy(&zcall_response[12],"##",4);
		//aoa_send_response(zcall_response, 16);
	//}else{
			
	
			//totallen = strlen("+ZCALL:");
		
		//	memcpy(zcall_response,"+ZCALL:",totallen);
			////memcpy(&zcall_response[totallen],gsn_buf,12);			
			//memcpy(zdev_set.mydev_id,gsn_buf,12);
			//totallen +=12;
			//memcpy(&zcall_response[totallen],",OK",3);
			//totallen +=3;
		   
		 // zcall_lenth = totallen;
			//memcpy(&buf[lenth1],"20",2);
			//lenth1 +=2;
			//memcpy(&zcall_response[totallen],version_info,8);
			//totallen +=8;
			//memcpy(&zcall_response[totallen],"##",2);
			//totallen +=2;
	   //	printf("zcall buf is %s \r\n",buf);
		   zdev_isbind = 1;
		//aoa_send_response(zcall_response, totallen);
		
	//}




	
	
}

uint8_t aoa_get_wlist_addr(uint8_t *data, uint16_t len, uint8_t idx)
{
			uint8_t head_len = 0,lenth;
			uint8_t count=0,count_bak =0;
			uint8_t back_buf[50];
			lenth=strlen("+ZSAVEB:");
			head_len = strlen("AT+ZSAVEB=");
			memcpy(back_buf,"+ZSAVEB:",lenth);
			
			while(data[count]){
						if(data[count] == ','){
								count_bak +=1;
						}
						if(count_bak == 2){
							if((data[count-1] -'0') == 1){
								memcpy(&zdev_set.bbinddev.bdev_id[0][zdev_set.bdevtask1_num][0],&data[count+1],12);
								
							  zdev_set.bbinddev.bdev_id[0][zdev_set.bdevtask1_num][12] = (1 + '0');
								
								printf("bdev_id %s \r\n",zdev_set.bbinddev.bdev_id[0][zdev_set.bdevtask1_num]);
								zdev_set.bdevtask1_num +=1;
							}else if((data[count-1] -'0') == 2){
								memcpy(&zdev_set.bbinddev.bdev_id[1][zdev_set.bdevtask2_num][0],&data[count+1],12);
								
