sunmny/z1/z1-stm32l476/Src/APP/app_aoa.c
								 zdev_set.bbinddev.bdev_id[1][zdev_set.bdevtask2_num][12] = (2 + '0');
								zdev_set.bdevtask2_num +=1;
							}
							
							break;
						}		
							count ++;
			}
		
			//printf();
			memcpy(&back_buf[lenth],&data[head_len],27);
			lenth +=27;
			
			memcpy(&back_buf[lenth],",",1);
			lenth +=1;
			memcpy(&back_buf[lenth],"OK",2);
			lenth +=2;
			
			memcpy(&back_buf[lenth],aoa_at_end_tok,AT_END_TOK_LEN);
			lenth +=AT_END_TOK_LEN;
			aoa_send_response(back_buf,lenth);
			return 0;
	

}

uint8_t wlist_group_count =0;
//AT+ZSAVEB=1,01,111234567890123##
//+ZSAVEB:1,01,111234567890123,OK##
uint8_t send_group_num_buf[20] = {0};

uint8_t send_wl_temp1[100][15];
uint8_t aoa_at_handle_zsaveb(uint8_t *data, uint16_t len, uint8_t idx) //test 
{
	    uint8_t lenth = 0,i =0,flag =0;
			uint8_t back_buf[30];
			lenth = strlen("AT+ZSAVEB=1,01,");
	    memcpy(back_buf,&data[2],25);
			memcpy(send_wl_temp1[wlist_count],&data[lenth],12); 
			send_wl_temp1[wlist_count][13] = (data[12] - '0')*10 + (data[13] - '0');
			for(i = 0;i<20;i++){
		     if(send_group_num_buf[i]== send_wl_temp1[wlist_count][13]){
				  // MAX_GROUP_NUM = send_wl_temp[wlist_count][13];
					 flag = 1;
					 break;
					 
				 }
			}
			if(!flag){
						send_group_num_buf[wlist_group_count] = send_wl_temp1[wlist_count][13];
						wlist_group_count++;
			}
			
			send_wl_temp1[wlist_count][12]  =  data[10] - '0';
			send_wl_temp1[wlist_count][14]  =  1;
			printf("send_wl_temp1[wlist_count] = %s %d\r\n",send_wl_temp1[wlist_count],send_group_num_buf[wlist_count]);
			
			wlist_count ++;
		//	bbind_num++;
			memcpy(&back_buf[25],",OK##",5);
			aoa_send_response(back_buf,30);

}
uint8_t aoa_at_handle_zbeat(uint8_t *data, uint16_t len, uint8_t idx)  //需要获取实际电量，rd的值
{
	uint16_t totallen;
	uint8_t response[64];
	uint8_t buf[6];
	//memcpy(buf,"gzid##",6);
	//send_getid_zdev(buf,6);
	totallen=make_zbeat_response(response);
	return aoa_send_response(response,totallen);
}

/*todo, check param len, may split data into serveral packages, 20181113*/
uint8_t handle_bdevice_rdsspower(uint8_t *data, uint16_t len, uint8_t idx)
{
	osStatus ret;
	ret=task_ble_mail_put(data, len);
	return ((uint8_t)(ret));
}

uint8_t handle_zdevice_rdsspower(uint8_t onoff, uint8_t idx)
{
	


	uint8_t result=0,res=0;
	if(hw_bd1_is_exist()==1)
	{
		if(onoff==0)
			hw_bd1_close();
		else if(onoff==1)
			hw_bd1_open();
	}
	else
	{
		hw_bd1_close();
		result=1;
	}
	res=make_zdevice_okerror_response(1,1,result,idx);
	return res;

}

uint8_t aoa_at_handle_rdsspower(uint8_t *data, uint16_t len, uint8_t idx)
{
	uint16_t totallen=0,lenth=0,lenth1 = 0;
	uint8_t ret,id1,id2;
	uint8_t response[128];
	
	
	lenth = strlen("AT+RDSSPOWER=");
	
	
	lenth1=strlen("+RDSSPOWER:");
	memcpy(response,"+RDSSPOWER:",lenth1);
	totallen+=lenth1;
	
	memcpy(&response[totallen],&data[lenth],1);
	totallen +=1;
	
	add_separator_comma(&response[totallen]);
		totallen+=1;
	memcpy(&response[totallen],&data[lenth+2],12);
	totallen +=12;
	
add_separator_comma(&response[totallen]);
		totallen+=1;
	memcpy(&response[totallen],"OK",2);
	totallen +=2;
	
	memcpy(&response[totallen],aoa_at_end_tok,AT_END_TOK_LEN);
	totallen+=AT_END_TOK_LEN;
	
	ret = aoa_send_response(response,totallen);
	#if 0
	ZbTokenizer  tzer[1];
	ZbToken  tok_device_id;
	uint16_t headerlen=0;
	uint8_t   deviceid[DEVICE_ID_LEN],res;

	headerlen=strlen(aoa_at_table[idx].pData);
	zb_tokenizer_init(tzer, data+headerlen, data+len);
	get_zdevice_id(deviceid);

	if(tzer[0].count==2)//maybe zdevice
	{
		tok_device_id = zb_tokenizer_get(tzer,0);
		if(0==memcmp(deviceid,tok_device_id.p,DEVICE_ID_LEN))
		{
			ZbToken tok_power=zb_tokenizer_get(tzer,1);
			if(tok_power.end-tok_power.p==2)//on
				res=handle_zdevice_rdsspower(1,idx);
			else if(tok_power.end-tok_power.p==3)//off
				res=handle_zdevice_rdsspower(0,idx);
		}
		else
		{
			res=handle_bdevice_rdsspower(data, len, idx);
		}
	}
	else
	{
		res=handle_bdevice_rdsspower(data, len, idx);
	}
	return res;
	#endif
}

/*todo, check param len, may split data into serveral packages, 20181113*/
uint8_t handle_bdevice_rnsspower(uint8_t *data, uint16_t len, uint8_t idx)
{
	osStatus ret;
	ret=task_ble_mail_put(data, len);
	return ((uint8_t)(ret));
}

uint8_t handle_zdevice_rnsspower(uint8_t onoff, uint8_t idx)
{
	uint8_t result=0,res=0;
	if(onoff==0)
		hw_bd2_close();
	else if(onoff==1)
		hw_bd2_open();
	res=make_zdevice_okerror_response(1,1,result,idx);
	return res;
}


uint8_t aoa_at_handle_rnsspower(uint8_t *data, uint16_t len, uint8_t idx)
{
	uint16_t totallen=0,lenth=0,lenth1 = 0;
	uint8_t ret,id1,id2;
	uint8_t response[128];
	
	
	lenth = strlen("AT+RNSSPOWER=");
	
	
	lenth1=strlen("+RNSSPOWER:");
	memcpy(response,"+RNSSPOWER:",lenth1);
	totallen+=lenth1;
	
	memcpy(&response[totallen],&data[lenth],1);
	totallen +=1;
	
	add_separator_comma(&response[totallen]);
		totallen+=1;
	memcpy(&response[totallen],&data[lenth+2],12);
	totallen +=12;
	
add_separator_comma(&response[totallen]);
		totallen+=1;
	memcpy(&response[totallen],"OK",2);
	totallen +=2;
	
	memcpy(&response[totallen],aoa_at_end_tok,AT_END_TOK_LEN);
	totallen+=AT_END_TOK_LEN;
	
	ret = aoa_send_response(response,totallen);
	
}

uint8_t handle_zdevice_airplanemode(uint8_t idx)
{
	uint8_t result=0,res=0;
	hw_bd1_close();
	hw_bd2_close();
	res=make_zdevice_okerror_response(1,1,result, idx);
	return res;
}


/*todo, check param len, may split data into serveral packages, 20181113*/
uint8_t handle_bdevice_airplanemode(uint8_t *data, uint16_t len, uint8_t idx)
{
	osStatus ret;
	ret=task_ble_mail_put(data, len);
	return ((uint8_t)(ret));
}

uint8_t addr_nv_buf[1500];

void clear_dev_nv(void)
{
	memset(addr_nv_buf,0x00,1500);
	set_nvram_id_data(addr_nv_buf);
	
	//memset(addr_nv_buf,0x00,1500);
	//set_nvram_id_data(addr_nv_buf);
}
void save_dev_addd_nv(void)
{
			uint8_t i,j;
			uint8_t ret;
		memset(addr_nv_buf,0x00,1500);
	for(i = 0;i<100;i++)
	{
			memcpy(&addr_nv_buf[i*15],send_wl_temp1[i],15);
	}
	
	taskENTER_CRITICAL();
	ret = set_nvram_id_data(addr_nv_buf);
	if(ret)
		 set_nvram_id_data(addr_nv_buf);
  taskEXIT_CRITICAL();
}
uint8_t open_airmode = 0;
uint8_t blebuf[50];
uint8_t group_location_count=0;
uint8_t air_count_bak =0;
uint8_t aoa_at_handle_airplanemode(uint8_t *data, uint16_t len, uint8_t idx)//需要修改
{
	uint8_t buf[30],flag =0;
	uint8_t lenth,lenth1 = 0;

	lenth1 = strlen("airplanemode:");
	lenth = strlen("AT+AIRPLANEMODE=");
	
