sunmny/z1/z1-stm32l476/Src/APP/app_aoa.c
	flag_airmod = 1;
	timer_send_count = 0;
	
	//osTimerStop(LedTimerHandle);
	
	
	 // save_nv_buf[2]=zdev_set.report_dis+'0';
	 // save_nv_buf[3]=zdev_set.report_bat_threshold+'0';
	

				//save_nv_buf[0] = '1';
		//set_nvram_save_data(save_nv_buf);
		
	memcpy(buf,"+AIRPLANEMODE:ON,OK##\r\n",25);
	aoa_send_response(buf,25);
	//	set_nvram_save_data(save_nv_buf);
	if(data[lenth] =='O'&&data[lenth+1] =='N'){
	//	ble_send_response("airmod:on\r\n",13);
		memcpy(blebuf,"airplanemode:",lenth1);
		memcpy(&blebuf[lenth1],zdev_set.mydev_id,12);
		lenth1 +=12;
		blebuf[lenth1] = ',';
		lenth1 +=1;
		if(zdev_set.other_id[0] == '1' &&zdev_set.other_id[1] == '0'){
		    memcpy(&blebuf[lenth1],zdev_set.other_id,12);
		}
		else
		{
		memcpy(&blebuf[lenth1],"000000000000",12);
		}
		lenth1 +=12;
		
		blebuf[lenth1] = ',';
		lenth1 +=1;
		
		blebuf[lenth1] = '0';
		lenth1 +=1;
		
		blebuf[lenth1] = '1';
		lenth1 +=1;
		
		blebuf[lenth1] = ',';
		lenth1 +=1;
		//group_location_count = lenth1;
		
	//	get_bdev_group_num();
	//	air_count_bak=lenth1;
		
	//	while(group_num_data){
		//lenth1 = air_count_bak;
		//blebuf[lenth1] = group_num_data /10 + '0';
		//lenth1 +=1;
		
		//blebuf[lenth1] = group_num_data %10 +'0';
		//lenth1 +=1;
		
		//memcpy(&blebuf[lenth1],"##",2);
	//	lenth1 +=2;
		//ble_send_response(blebuf,lenth1);
			//group_num_data--;
		//osDelay(300);
		//}
		hw_bd1_close();
		hw_bd2_close();
		
		set_command_type(0xf2);
	}else {
		hw_bd1_open();
		hw_bd2_open();
		set_command_type(0xff);
		//ble_send_response("airmod:off\r\n",14);
	}

}
extern uint8_t bd_send_resp_len;
uint8_t aoa_at_handle_zlocation(void)
{
	uint16_t resplen=0;
	uint8_t buf[80];/*to do, are 80 bytes enough?*/
	resplen=get_zdevice_location_response(buf);
	return aoa_send_response(response_location, bd_send_resp_len);
}



/*
AT+BBROADCAST?
+BBROADCAST:3,111234567890123,121234567890124,131234567890124
*/
uint16_t make_bbroadcast_response(uint8_t *response)
{
	
}
 //set bbro get how much bdev;
uint8_t aoa_at_handle_bbroadcast(uint8_t *data, uint16_t len, uint8_t idx)
{
	
}

uint8_t aoa_at_handle_bcall(uint8_t *data, uint16_t len, uint8_t idx)
{

	
}


/*
AT+BBIND=111234567890123,111234567890124
+BBIND:111234567890123,OK,111234567890124,ERROR
*/



uint8_t bdev_id_temp_buf[13];

uint8_t get_task_bdev_id(uint8_t *data , uint16_t len ,uint8_t idx)
{
		uint8_t head_len = 0,i=0,end_count = 0;
		uint8_t count = 0,par_count =0,temp_count[20];
		uint8_t j = 0;
		head_len = strlen("AT+BBIND=");
		count = head_len;
		
			
		if((data[head_len] == '1' ||data[head_len] == '2') && data[head_len+1] ==','){
					zdev_set.zdev_num = 1;
					zdev_set.bbinddev.bdev_taskid = data[head_len] - '0';
			if(zdev_set.bbinddev.bdev_taskid ==1){
						for(j =0;j<100;j++){
							printf("bdev id is come \r\n");
						if(0==(memcmp(&zdev_set.bbinddev.bdev_id[0][j][0], &data[head_len +2],12))){
						
						 printf("bdev id is in\r\n");
						break;
						}else{
						///	memset(&zdev_set.bbinddev.bdev_id[0][j][0],0x00,13);
							 printf("zdev_set.bbinddev.bdev_id[0][%d][0] = %x %x %x %x \r\n",j,zdev_set.bbinddev.bdev_id[0][j][0],zdev_set.bbinddev.bdev_id[0][j][1],zdev_set.bbinddev.bdev_id[0][j][2],zdev_set.bbinddev.bdev_id[0][j][3]);
							if(zdev_set.bbinddev.bdev_id[0][j][0] == 0 && zdev_set.bbinddev.bdev_id[0][j][1] == 0 && zdev_set.bbinddev.bdev_id[0][j][2] ==0 &&zdev_set.bbinddev.bdev_id[0][j][3] ==0){
						memcpy(&zdev_set.bbinddev.bdev_id[0][zdev_set.bdevtask1_num][0], &data[head_len +2],12);
						memcpy(&zdev_set.bbinddev.bdev_id[0][zdev_set.bdevtask1_num][12],"1",1);
					  memcpy(bdev_id_temp_buf,&data[head_len +2],12);
					  printf("bdev id is0 %s \r\n",zdev_set.bbinddev.bdev_id[0][zdev_set.bdevtask1_num]);
						zdev_set.bdevtask1_num++;
							break;
						}
						}
					}
				
					}else if(zdev_set.bbinddev.bdev_taskid ==2){
						
						for(j =0;j<100;j++){
						if(0==(memcmp(&zdev_set.bbinddev.bdev_id[1][j][0], &data[head_len +2],12))){
						
						 printf("bdev id is in\r\n");
						break;
						}else{
							
						if(zdev_set.bbinddev.bdev_id[1][j][0] == 0 && zdev_set.bbinddev.bdev_id[1][j][1] == 0 && zdev_set.bbinddev.bdev_id[1][j][2] ==0 &&zdev_set.bbinddev.bdev_id[1][j][3] ==0){ 
						memcpy(bdev_id_temp_buf,&data[head_len +2],12);
						memcpy(&zdev_set.bbinddev.bdev_id[1][zdev_set.bdevtask2_num][0], &data[head_len +2],12);
						zdev_set.bbinddev.bdev_id[1][zdev_set.bdevtask2_num][12] = '2' ;
						printf("bdev id is1 %s \r\n",zdev_set.bbinddev.bdev_id[1][zdev_set.bdevtask2_num]);
						zdev_set.bdevtask2_num++;
							break;
						}
						}
						
					
						
					}
		
		}
		}else{
				zdev_set.bbinddev.bdev_taskid = data[head_len +13] - '0';
				memcpy(zdev_set.other_id,&data[head_len],DEVICE_ID_LEN);
				printf("zdev_set.other_id is %s \r\n",zdev_set.other_id);
				zdev_set.zdev_num = 2;
				if(zdev_set.bbinddev.bdev_taskid ==1){
					
					for(j =0;j<100;j++){
						if(0==(memcmp(&zdev_set.bbinddev.bdev_id[0][j][0], &data[head_len +15],12))){
							printf("bdev id is in\r\n");
							break;
						}else{
								if(zdev_set.bbinddev.bdev_id[0][j][0] == 0 && zdev_set.bbinddev.bdev_id[0][j][1] == 0 && zdev_set.bbinddev.bdev_id[0][j][2] ==0 &&zdev_set.bbinddev.bdev_id[0][j][3] ==0){
						memcpy(&zdev_set.bbinddev.bdev_id[0][zdev_set.bdevtask1_num][0], &data[head_len +15],12);
						zdev_set.bbinddev.bdev_id[0][zdev_set.bdevtask1_num][12] = '1' ;
					memcpy(bdev_id_temp_buf,&data[head_len +15],12);
					printf("bdev id is4 %s \r\n",zdev_set.bbinddev.bdev_id[0][zdev_set.bdevtask1_num]);
						zdev_set.bdevtask1_num++;
						break;
								}
						}
					}
					}else if(zdev_set.bbinddev.bdev_taskid ==2){
						for(j =0;j<100;j++){
						if(0==(memcmp(&zdev_set.bbinddev.bdev_id[1][j][0], &data[head_len +15],12))){
							printf("bdev id is in\r\n");
							break;
						}else{
								if(zdev_set.bbinddev.bdev_id[1][j][0] == 0 && zdev_set.bbinddev.bdev_id[1][j][1] == 0 && zdev_set.bbinddev.bdev_id[1][j][2] ==0 &&zdev_set.bbinddev.bdev_id[1][j][2] ==0){ 
						memcpy(bdev_id_temp_buf,&data[head_len +15],12);
						memcpy(&zdev_set.bbinddev.bdev_id[1][zdev_set.bdevtask2_num][0], &data[head_len +15],12);
						zdev_set.bbinddev.bdev_id[1][zdev_set.bdevtask2_num][12] = '2' ;
						printf("bdev id is5 %s \r\n",zdev_set.bbinddev.bdev_id[1][zdev_set.bdevtask2_num]);
						zdev_set.bdevtask1_num++;
							break;
								}
						}
						}
					}
		
