sunmny/z1/z1-stm32l476/Src/APP/app_aoa.c
		}
	}	
	


extern void send_wlist_to_ble(void);
	
uint8_t command_type = 0xff;

void set_command_type(uint8_t command)
{
		command_type = command;
}
uint8_t get_command_type(void)
{
		return command_type ;
}
	

/*************group is 0-x***********/
	
extern osTimerId LedTimerHandle;
extern uint8_t devinfo_flag ;
uint8_t task_send_count =0;
uint8_t test_begin(uint8_t *data, uint16_t len, uint8_t idx)
{
	
	
	devinfo_flag =0;
	task_flag_start =1;
	contiue_task =1;
	
	save_nv_buf[0] = '1';
	
		save_nv_buf[1] = zdev_set.isMdev ;

	
	//get_bdev_group_num();
	//save_nv_buf[69] =  bbind_num;
	
	copy_addr_group();
	memcpy(&save_nv_buf[30],send_group_num_buf,20);
	
	memcpy(&save_nv_buf[10],zdev_set.other_id,12);
	save_flas =1;
 
  set_command_type(0xf1);
	if(!get_timer_status()){
				 osTimerStart(LedTimerHandle, 3500);
					set_timer_status(1);
	}
	//save_dev_addr();
	
}


void send_bbind_command(void)
{
		uint8_t commnd_buf[50];
  uint8_t totallen1 =0;
		totallen1 = strlen("taskstart:");
	memcpy(commnd_buf,"taskstart:",totallen1);
	

	
	printf("group_num_data = %d \r\n",group_num_data);

		  if(zdev_set.isMdev ==0){
			memcpy(&commnd_buf[totallen1],zdev_set.mydev_id,12);
			totallen1+=12;
	
			commnd_buf[totallen1] = ',';
			totallen1+=1;
			
			memcpy(&commnd_buf[totallen1],"000000000000",12);
			
			totallen1+=12;
		}else if(zdev_set.isMdev ==1){
				memcpy(&commnd_buf[totallen1],zdev_set.mydev_id,12);
			totallen1+=12;
	
			commnd_buf[totallen1] = ',';
			totallen1+=1;
			
			memcpy(&commnd_buf[totallen1],zdev_set.other_id,12);
			totallen1+=12;
		
		}else if(zdev_set.isMdev ==2){
			memcpy(&commnd_buf[totallen1],zdev_set.other_id,12);
			totallen1+=12;
	
			commnd_buf[totallen1] = ',';
			totallen1+=1;
			memcpy(&commnd_buf[totallen1],zdev_set.mydev_id,12);
			totallen1+=12;
		}
	//	memcpy(&commnd_buf[totallen1],zdev_set.mydev_id,12);
	//	totallen1 +=12;
	//commnd_buf[totallen1] = ',';
	//totallen1 +=1;
	
	//if(zdev_set.isMdev ==0){
	
	//	memcpy(&commnd_buf[totallen1],zdev_set.other_id,12);
	//	totallen1 += 12;
	
	
	//}else{
		
		//	memcpy(&commnd_buf[totallen1],"000000000000",12);
			//totallen1 += 12;
	///}
	
	commnd_buf[totallen1] = ',';
	totallen1 +=1;
	
		commnd_buf[totallen1] = '0';
	totallen1 +=1;
	
		
		commnd_buf[totallen1] = '1';
			
			totallen1 +=1;
	
		commnd_buf[totallen1] = ',';
	  totallen1 +=1;
	
	
		if(send_group_num_buf[task_send_count] !=0){
	   commnd_buf[totallen1] = send_group_num_buf[task_send_count]/10 +'0';
			totallen1 += 1;
			commnd_buf[totallen1] = send_group_num_buf[task_send_count]%10 +'0';
			totallen1 += 1;
			task_send_count++;
		}else {
			task_send_count = 0;
			commnd_buf[totallen1] = send_group_num_buf[task_send_count]/10 +'0';
			totallen1 += 1;
			commnd_buf[totallen1] = send_group_num_buf[task_send_count]%10 +'0';
			totallen1 += 1;
			task_send_count++;
		}
	
	   commnd_buf[totallen1] = ',';
	   totallen1 +=1;
	   memcpy(&commnd_buf[totallen1],"01",2);
			totallen1 += 2;
			 memcpy(&commnd_buf[totallen1],"##",2);
			totallen1 += 2;
			printf("task start commnd_buf %s \r\n",commnd_buf);
				//get_bdev_group_num();

		   ble_send_response(commnd_buf, totallen1);	
}
uint8_t air_command_send_count =0;

void send_airmode_command(void)
{
	uint8_t buf[30],flag =0;
	uint8_t lenth,lenth1 = 0;

	lenth1 = strlen("airplanemode:");
	get_bdev_group_num();

		memcpy(blebuf,"airplanemode:",lenth1);
	//	memcpy(&blebuf[lenth1],zdev_set.mydev_id,12);
		//lenth1 +=12;
		//blebuf[lenth1] = ',';
		//lenth1 +=1;
		//if(zdev_set.other_id[0] == '1' &&zdev_set.other_id[1] == '0'){
		//memcpy(&blebuf[lenth1],zdev_set.other_id,12);
		//}
		//else
		//{
		//memcpy(&blebuf[lenth1],"000000000000",12);
		//}
		//lenth1 +=12;
		
		if(zdev_set.isMdev ==0){
			memcpy(&blebuf[lenth1],zdev_set.mydev_id,12);
			lenth1+=12;
	
			blebuf[lenth1] = ',';
			lenth1+=1;
			
			memcpy(&blebuf[lenth1],"000000000000",12);
			
			lenth1+=12;
		}else if(zdev_set.isMdev ==1){
				memcpy(&blebuf[lenth1],zdev_set.mydev_id,12);
			lenth1+=12;
	
			blebuf[lenth1] = ',';
			lenth1+=1;
			
			memcpy(&blebuf[lenth1],zdev_set.other_id,12);
			lenth1+=12;
		
		}else if(zdev_set.isMdev ==2){
			memcpy(&blebuf[lenth1],zdev_set.other_id,12);
			lenth1+=12;
	
			blebuf[lenth1] = ',';
			lenth1+=1;
			memcpy(&blebuf[lenth1],zdev_set.mydev_id,12);
			lenth1+=12;
		}
		
		
		
		blebuf[lenth1] = ',';
		lenth1 +=1;
		
		blebuf[lenth1] = '0';
		lenth1 +=1;
		
		blebuf[lenth1] = '1';
		lenth1 +=1;
		
		blebuf[lenth1] = ',';
		lenth1 +=1;
		group_location_count = lenth1;
		
		//get_bdev_group_num();
		//printf("airmode blebuf %s \r\n",blebuf);
		
		if(send_group_num_buf[air_command_send_count] !=0){
	       blebuf[lenth1] = send_group_num_buf[air_command_send_count]/10 +'0';
			   lenth1 +=1;
			   blebuf[lenth1] = send_group_num_buf[air_command_send_count]%10 +'0';
			    lenth1 += 1;
					
		      memcpy(&blebuf[lenth1],"##",2);
		      lenth1 +=2;
		      ble_send_response(blebuf,lenth1);
					printf("airmode blebuf %s \r\n",blebuf);
			    air_command_send_count++;
		}else {
				memcpy(&save_nv_buf[30],send_group_num_buf,20);
				task_send_count = 0;
				set_command_type(0xff);
				air_command_send_count =0;
			
			 blebuf[lenth1] = '0';
			   lenth1 +=1;
			   blebuf[lenth1] = '0';
			    lenth1 += 1;
					
		      memcpy(&blebuf[lenth1],"##",2);
		      lenth1 +=2;
		      ble_send_response(blebuf,lenth1);
				save_flas =1;
				open_airmode =1;
				//blebuf[lenth1] = send_group_num_buf[air_command_send_count]/10 +'0';
			//	lenth1 +=1;
			//	blebuf[lenth1] = send_group_num_buf[air_command_send_count]%10 +'0';
			//	lenth1 +=1;
				//air_command_send_count++;
		}
		
		//blebuf[lenth1] = air_command_send_count /10 + '0';
		//lenth1 +=1;
		
		//blebuf[lenth1] = air_command_send_count %10 +'0';
		//lenth1 +=1;
	
	
}
uint8_t ubind_command_count =0;
extern uint8_t ubind_all_flag;

void send_ubind_command(void)
{
			uint8_t response[50];
			uint8_t totallen =0;
				get_bdev_group_num();
		    //if(ubind_command_count ==group_num_data){
		         //bbind_num =0;
					//	return ;
		     //}
		       memcpy(response,"ubind:",6);
					totallen +=6;
				
		     // memcpy(&response[totallen],zdev_set.mydev_id,12);
					//totallen +=12;
		      // memcpy(&response[totallen],",",1);
					// totallen +=1;
				  //if(zdev_set.other_id[0] == '1' && zdev_set.other_id[1] =='0'){
					//memcpy(&response[totallen],zdev_set.other_id,12);
					//}else{
					// memcpy(&response[totallen],"000000000000",12);
					
				 // }
					//totallen +=12;
					
					if(zdev_set.isMdev ==0){
			memcpy(&response[totallen],zdev_set.mydev_id,12);
			totallen+=12;
	
			response[totallen] = ',';
			totallen+=1;
			
			memcpy(&response[totallen],"000000000000",12);
			
			totallen+=12;
		}else if(zdev_set.isMdev ==1){
				memcpy(&response[totallen],zdev_set.mydev_id,12);
			totallen+=12;
	
			response[totallen] = ',';
			totallen+=1;
			
