sunmny/z1/z1-stm32l476/Src/APP/app_aoa.c
			memcpy(&response[totallen],zdev_set.other_id,12);
			totallen+=12;
		
		}else if(zdev_set.isMdev ==2){
			memcpy(&response[totallen],zdev_set.other_id,12);
			totallen+=12;
	
			response[totallen] = ',';
			totallen+=1;
			memcpy(&response[totallen],zdev_set.mydev_id,12);
			totallen+=12;
		}
					
		       memcpy(&response[totallen],",",1);
					 totallen +=1;
		      memcpy(&response[totallen],"00",2);
					totallen +=2;
					memcpy(&response[totallen],",",1);
					 totallen +=1;
				
					
		if(send_group_num_buf[ubind_command_count] !=0){
	   response[totallen] = send_group_num_buf[ubind_command_count]/10 +'0';
			totallen +=1;
			response[totallen] = send_group_num_buf[ubind_command_count]%10 +'0';
			totallen += 1;
			 memcpy(&response[totallen],"##",2);
					
					 totallen +=2;
		
				  ble_send_response(response, totallen);
					printf("ubind send ble :%s \r\n",response);
			ubind_command_count++;
		}else {
			     ubind_command_count = 0;
			     set_command_type(0xff);
			     memset(send_group_num_buf,0x00,20);
			      memset(send_wl_temp1,0x00,1500);
					//memset(bd_info,0x00,sizeof(bd_info));
			clear_bd_info();
						bbind_num= 0;
						wlist_count = 0;
				wlist_group_count = 0;
			 response[totallen] = '0';
			totallen +=1;
			response[totallen] =  '0';
			totallen += 1;
					 memcpy(&response[totallen],"##",2);
					
					 totallen +=2;
		
				  ble_send_response(response, totallen);
			    task_flag_start = 0;
						if(get_timer_status()){
						osTimerStop(LedTimerHandle);
						set_timer_status(0);
						ubind_all_flag =1;
							//memset(save_nv_buf,0x00,70);
							
						}
		
		    }
		
					
		      
							

}


uint8_t call_flag=0;
//extern osTimerId ReportTimerHandle;
void LedTimerCallback(void const * argument)
{
uint8_t cmd;
	 
	if(call_flag ==1){
		if(task_flag_start ==1)
		   set_command_type(0xf1);	
	    send_light_commnd =0;
			call_flag =0;
	 }
	 if(send_light_commnd ==1){
				set_command_type(0xff);
				call_flag=1;
	 }else if(send_light_commnd ==2){
					set_command_type(0xff);
					call_flag=1;
	 }
	 cmd = get_command_type();
	printf("LedTimerCallback cmd = %x \r\n",cmd);
	switch(cmd){
		case 0xf1:
			send_bbind_command();
			break;
		case 0xf2:
			send_airmode_command();
			break;
		case 0xf3:
			//osTimerStop(ReportTimerHandle);
			send_ubind_command();
			break;
		
		default:
				break;
	 }

	


}


//+WARINGSTATUS=ON,OK##\r\n; 
uint8_t aoa_at_handle_close_bdev_report(uint8_t *data, uint16_t len, uint8_t idx)
{
			uint8_t lenth = 0,lenth1 = 0;
			lenth = strlen("AT+WARINGSTATUS=");
			uint8_t temp_buf[15],temp_buf2[25];
			memcpy(temp_buf,"bdclose:",8);
			lenth1 = 8;
			printf(" WARINGSTATUS data %s lenth %d\r\n ",data,lenth);
			if((data[lenth] == 'O')&&(data[lenth+1] == 'F')){
				memcpy(&temp_buf[lenth1],"off",3);
				lenth1 +=3;
				memcpy(temp_buf2,"+WARINGSTATUS:OFF,OK",20);
				memcpy(&temp_buf2[20],aoa_at_end_tok,AT_END_TOK_LEN);
				
				aoa_send_response(temp_buf2,24);
				printf(" WARINGSTATUS data %s \r\n ",temp_buf2);
			}else if((data[lenth] == 'O')&&(data[lenth+1] == 'N')){
			
				memcpy(&temp_buf[lenth1],"on",2);
				lenth1 +=2;
				memcpy(temp_buf2,"+WARINGSTATUS:ON,OK",19);
				
				memcpy(&temp_buf2[19],aoa_at_end_tok,AT_END_TOK_LEN);
				aoa_send_response(temp_buf2,23);
			
				printf(" WARINGSTATUS data %s \r\n ",temp_buf2);
			}
			
		ble_send_response(temp_buf, lenth1);
}

uint8_t backup_buf[50]; //= "AT+BBIND=1,132009220010,18001314967##";
uint8_t apn_buf[80];
uint8_t bind_command_buf_bak[100];
uint16_t bind_command_len_bak;
uint8_t wlist_continue_send_flag =0;
uint8_t zdev_bind_flag =0;

uint8_t new_dev = 0;

extern uint8_t send_wl_temp[100][15];
extern uint8_t devinfo_start_flag;
extern uint8_t devinfo_flag;
uint8_t bbind_back_dev_buf[12];
// bbind=1,2,2,223456,000000000000,109988998889##
uint8_t aoa_at_handle_bbind(uint8_t *data, uint16_t len, uint8_t idx)
{
//	osTimerStop(ReportTimerHandle);	
	uint16_t totallen=0,lenth = 0,lenth1;
	//uint8_t send_buf[100];
	uint8_t backbuf[40],bdadd_buf[80],devid_buf[12];
	uint8_t count =0,i =0;
	uint8_t count1 =0;
	uint8_t backlen  = 0;
  uint8_t group_num = 0;
	
	
	devinfo_start_flag =0;
	if(bbind_num >100)
		return 0;
	if(task_flag_start ==0){
		set_command_type(0xff);
	}
		if(task_flag_start && get_timer_status()){
	    osTimerStop(LedTimerHandle);
			set_timer_status(0);
			set_command_type(0xff);
		}
		
	  zdev_bind_flag =1 ;
	//	save_nv_buf[1] = '1';
	memset(apn_buf,0x00,50);
	memcpy(backup_buf,data,len);
	hw_bd2_close();

	lenth = strlen("bbind:");
	lenth1 = lenth;
	//memcpy(apn_buf,"bbind=",lenth);
	totallen +=lenth;
//AT+BBIND=1,112019060053,19910232427##
	memcpy(bind_command_buf_bak,data,len);
	bind_command_len_bak = len;
	while(data[count]){
			if(data[count] == ','){
					count1++;
			}
			if(count1 ==1){
					if((data[count-2] == '=')&&(data[count-1] =='1' ||data[count-1]=='2'))
					{
						memcpy(bdadd_buf,"bbind:",lenth1);
					memcpy(&bdadd_buf[lenth1],&data[count+1],12);
						
					memcpy(devid_buf,&data[count+1],12);
					memcpy(bbind_back_dev_buf,devid_buf,12);
						lenth1 +=12;
					
					taskidnum = data[count-1] - '0';
					//send_wl_temp[bbind_num][12] = taskidnum; 
						
						
					if(data[count+14] == '1')
						memcpy(&apn_buf[totallen],&data[count+14],11);
					else
						memcpy(&apn_buf[totallen],"00000000000",11);
					//ble_send_response(bdadd_buf, 21);
						break;
					}
			}
			if(count1 ==2){
					
					memcpy(bdadd_buf,"bbind:",lenth1);
					memcpy(&bdadd_buf[lenth1],&data[count+1],12);
					memcpy(devid_buf,&data[count+1],12);
				memcpy(bbind_back_dev_buf,devid_buf,12);
					lenth1 +=12;
					taskidnum = data[count-1] - '0';
				 // send_wl_temp[bbind_num][12] = taskidnum; 
				//printf("copy addr2 %s %d \r\n",send_wl_temp[bbind_num],send_wl_temp[bbind_num][12]);
					//memcpy(&bdadd_buf[19],"##",2);
					if(data[count+14] == '1')
						memcpy(&apn_buf[totallen],&data[count+14],11);
					else
						memcpy(&apn_buf[totallen],"00000000000",11);
				 // ble_send_response(bdadd_buf, 21);
				break;
			}
	
