sunmny/z1/z1-stm32l476/Src/APP/app_aoa.c
		count++;
	}
	
	
		for(i = 0; i<100 ;i++){
				if(send_wl_temp[i][14] == 0){
						if(0 == memcmp(send_wl_temp[i],devid_buf,12)){
									new_dev = 0;
									group_num = send_wl_temp[i][13];
						}else{
								  new_dev = 1;
							    
						}
				
				}else{
					continue ;
				}
	}
		if(new_dev){
			group_num = get_bdev_group_num();
			send_wl_temp[bbind_num][13] = group_num;
			memcpy(send_wl_temp[bbind_num],devid_buf,12);
			bbind_num ++;
		} 
	
	 printf("mac group_nu %s %d \r\n",send_wl_temp[bbind_num],send_wl_temp[bbind_num][13]);
	
    bdadd_buf[lenth1] = ',';
    lenth1+=1;
	
	  if(zdev_set.isMdev ==0){
			memcpy(&bdadd_buf[lenth1],zdev_set.mydev_id,12);
			lenth1+=12;
	
			bdadd_buf[lenth1] = ',';
			lenth1+=1;
			
			memcpy(&bdadd_buf[lenth1],"000000000000",12);
			
			lenth1+=12;
		}else if(zdev_set.isMdev ==1){
				memcpy(&bdadd_buf[lenth1],zdev_set.mydev_id,12);
			lenth1+=12;
	
			bdadd_buf[lenth1] = ',';
			lenth1+=1;
			
			memcpy(&bdadd_buf[lenth1],zdev_set.other_id,12);
			lenth1+=12;
		
		}else if(zdev_set.isMdev ==2){
			memcpy(&bdadd_buf[lenth1],zdev_set.other_id,12);
			lenth1+=12;
	
			bdadd_buf[lenth1] = ',';
			lenth1+=1;
			memcpy(&bdadd_buf[lenth1],zdev_set.mydev_id,12);
			
			lenth1+=12;
	
		}
	
	
	// if(zdev_set.isMdev !=0){
	
		
			//memcpy(&bdadd_buf[lenth1],zdev_set.other_id,12);
			//lenth1+=12;
	
		
			//memcpy(&apn_buf[totallen],zdev_set.other_id,12);
			//totallen += 12;
	
			//apn_buf[totallen] = ',';
			//totallen +=1;
	// }else{
		
			//memcpy(&bdadd_buf[lenth1],"000000000000",12);
			//lenth1+=12;
		
			//memcpy(&apn_buf[totallen],"000000000000",12);
			//totallen += 12;
	
		//	apn_buf[totallen] = ',';
		//	totallen +=1;
		
		
		
	//}
			bdadd_buf[lenth1] = ',';
			lenth1+=1;
	
			bdadd_buf[lenth1] = '0';
			lenth1+=1;

			lenth = strlen(zdev_set.mydev_id);
			memcpy(&apn_buf[totallen],zdev_set.mydev_id,12); //调试注释掉 20190529
		//memcpy(&send_buf[totallen],"112233998877",12);
		totallen += 12;
		if((taskidnum ==1) || (taskidnum ==2)){
			bdadd_buf[lenth1] = taskidnum + '0';
			lenth1+=1;
			apn_buf[totallen] = taskidnum + '0';
	//send_buf[totallen] = ',';
			totallen +=1;
		}


		bdadd_buf[lenth1] = ',';
		lenth1+=1;

	if(group_num <10){
	 bdadd_buf[lenth1] = '0';
   lenth1+=1;
   bdadd_buf[lenth1] = group_num + '0';
   lenth1+=1;
	}else{
  
   bdadd_buf[lenth1] = (group_num /10) +'0';
   lenth1+=1;
   bdadd_buf[lenth1] = (group_num%10) + '0';
   lenth1+=1;
	}
	bdadd_buf[lenth1] = ',';
			lenth1+=1;
	memcpy(&bdadd_buf[lenth1],"15",2);
   lenth1+=2;
	bdadd_buf[lenth1] = ',';
			lenth1+=1;
	memcpy(&bdadd_buf[lenth1],"01",2);
   lenth1+=2;
	
	memcpy(&bdadd_buf[lenth1],"##",2);
   lenth1+=2;
	
	ble_send_response(bdadd_buf, lenth1);
	
	//ble_send_response(apn_buf, totallen);
	
if(task_flag_start &&(!get_timer_status())){
	  osTimerStart (LedTimerHandle, 3500);
	  set_timer_status(1);
	
}

	memset(backbuf,0x00,40);
	memcpy(backbuf,"+BBIND:",7);
	memcpy(&backbuf[7],&data[9],14);
  backbuf[21] = (group_num /10) +'0';
 	 backbuf[22] = (group_num %10) +'0';
	memcpy(&backbuf[23],",OK",3);	
	memcpy(&backbuf[26],aoa_at_end_tok,AT_END_TOK_LEN);	
 

	if(task_flag_start){
		set_command_type(0xf1);
	}
	if(task_flag_start)
			devinfo_start_flag =1;
	
	printf("bbind send_buf %s %d\r\n",bdadd_buf,task_flag_start);
	
}
 
uint8_t ubind_back[50];
uint8_t ubind_back_err[50];
uint8_t ubind_len =0;
uint8_t ubind_len_err =0;
extern uint8_t send_wl_temp[100][15];
uint8_t ubind_flag = 0;
extern uint8_t sendid_count;
//uint8_t response_ubind[32];
extern uint8_t bind_bak_buf[50];
extern uint8_t devinfo_start_flag ;
uint8_t aoa_at_handle_bunbind(uint8_t *data, uint16_t len, uint8_t idx)
{
	uint16_t totallen = 0,lenth,i,totallen_bak;
	uint8_t response[52];
	uint8_t unbind_id_buf[12];
	


	lenth=strlen("AT+BUNBIND=");
printf("aoa_at_handle_bunbind \r\n");
	#if 1
	switch(data[lenth]){
		case '0':
			
				//task_flag_start=0;
		    devinfo_start_flag =0;
						//osTimerStop(LedTimerHandle);
				memset(bind_bak_buf,0x00,50);
					//task_flag_start=0;
						save_nv_buf[0] = '0';
		      // memcpy(response,"ubind:",6);
		     if(!get_timer_status()){
			   osTimerStart(LedTimerHandle,3500);
		     set_timer_status(1);
		   }
				devinfo_flag =0;
					zdev_isbind=0;
					//memset(zdev_set.bbinddev.bdev_id,0x00,sizeof(zdev_set.bbinddev.bdev_id));
					//memset(&zdev_set.bbinddev.bdev_id[0][0][0],0x00,1300);
					//memset(&zdev_set.bbinddev.bdev_id[1][0][0],0x00,1300);
					//memset(save_nv_buf,0x00,70);
					//if(zdev_set.isMdev ==1)
				 
					//set_nvram_save_data(save_nv_buf);
					zdev_set.bdevtask1_num =0;
					zdev_set.bdevtask2_num = 0;
					set_ble_red_light(1);
 					save_nv_buf[0] = '0';
					//set_nvram_save_data(save_nv_buf);
					ubind_flag = 0;
					//clear_dev_nv();
					memset(send_wl_temp,0x00,1500);
					set_command_type(0xf3);
					//bbind_num =0;
					printf("ubind0  %x  \r\n",command_type);
					//BatTimerCallback();
					//osTimerStop(LedTimerHandle);
		
			break;
		case '1':
			memcpy(response,"subind:",7);
					totallen +=7;
		  
						memset(bind_bak_buf,0x00,50);
							set_command_type(0xff);
		        send_light_commnd =1;
					if(data[lenth+1] != ','){

							//response[totallen] = '1';
							//totallen +=1;
							//memcpy(&response[totallen],aoa_at_end_tok,AT_END_TOK_LEN);
							//totallen+=AT_END_TOK_LEN;
							memset(zdev_set.bbinddev.bdev_id[0],0x00,1300);
					}else{
						
						
							//response[totallen] = '1';
							//totallen +=1;
							//response[totallen] = ',';
							//totallen +=1;
							memcpy(&response[totallen],&data[lenth+2],12);
							totallen +=12;
						response[totallen] = ',';
							totallen +=1;
						
					
							memcpy(unbind_id_buf,&data[lenth+2],12);
						
							
							memcpy(&response[totallen],"01",2);
							totallen+=2;
							response[totallen] = ',';
							totallen +=1;
						
						get_bdev_group_num();
					
					response[totallen] = group_num_data/10 + '0';
					totallen+=1;
					response[totallen] = group_num_data%10 + '0';
					
					totallen+=1;
					
		       memcpy(&response[totallen],"##",2);
					 totallen +=2;
						
						 
		
							for(i =0 ;i<100;i++){
								printf("send_wl_temp %s  \r\n",send_wl_temp1[i]);
										if(0 == memcmp(unbind_id_buf,send_wl_temp1[i],12)){
												printf("unbind_id_buf %s %s \r\n",unbind_id_buf,send_wl_temp1[i]);
													memset(send_wl_temp1[i],0x00,15);
											if(bbind_num >= 1)
												   bbind_num-=1;
										}
										
							
