sunmny/z1/z1-stm32l476/Src/APP/app_aoa.c
							}
							
		//					save_dev_addd_nv();
					}
						if((zdev_set.bdevtask2_num == 0) && (zdev_set.bdevtask1_num == 0))
							set_ble_red_light(1);
						
						ubind_flag = 1;
//						save_dev_addd_nv();
						
						copy_addr_group();
						
					//if(zdev_set.isMdev ==1)
					ble_send_response(response, totallen);
						printf("subind1  %s  \r\n",response);
		
			break;
		case '2':
			memcpy(response,"subind:",7);
					totallen +=7;
							memset(bind_bak_buf,0x00,50);
							send_light_commnd=1;
							set_command_type(0xff);
		        
					if(data[lenth+1] != ','){

							//response[totallen] = '2';
							//totallen +=1;
						//	memcpy(&response[totallen],aoa_at_end_tok,AT_END_TOK_LEN);
						//	totallen+=AT_END_TOK_LEN;
							memset(zdev_set.bbinddev.bdev_id[1],0x00,1300);
					}else{
							memcpy(&response[totallen],&data[lenth+2],12);
						  	totallen +=12;
							response[totallen] = ',';
							totallen +=1;
							
							memcpy(unbind_id_buf,&data[lenth+2],12);
						
							memcpy(&response[totallen],"02",2);
							totallen+=2;
						
						response[totallen] = ',';
							totallen +=1;
						
						get_bdev_group_num();
					
					response[totallen] = group_num_data/10 + '0';
					totallen+=1;
					response[totallen] = group_num_data%10 + '0';
					
					totallen+=1;
					
		       memcpy(&response[totallen],"##",2);
					 totallen +=2;
		
				// ble_send_response(response, totallen);
						
					
						
					
							for(i =0 ;i<100;i++){
										printf("send_wl_temp %s  \r\n",send_wl_temp1[i]);
										if(0 == memcmp(unbind_id_buf,&send_wl_temp1[i][0],12)){
											printf("unbind_id_buf %s %s \r\n",unbind_id_buf,send_wl_temp1[i]);
													memset(send_wl_temp1[i],0x00,15);
												if(bbind_num >= 1)
													   bbind_num-=1;
										}
							
							}
//							save_dev_addd_nv();
					}
					printf("response is %s \r\n",response);
					if((zdev_set.bdevtask2_num == 0) && (zdev_set.bdevtask1_num == 0))
							set_ble_red_light(1);
					
					ubind_flag = 2;
					//if(zdev_set.isMdev ==1)
					copy_addr_group();
					
					ble_send_response(response, totallen);
					printf("subind2  %s  \r\n",response);
			break;
				
			
			defualt:
					break;
	
	
	
	}
	#endif
	//+BUNBIND:
	if(data[lenth] =='0' &&data[lenth+1] =='#'){
		printf("AT+BUNBIND=0 \r\n");
		memset(ubind_back,0x00,50);
				memcpy(ubind_back,"+BUNBIND:",9);
		memcpy(&ubind_back[9],"0,OK",4);
	
		memcpy(&ubind_back[13],aoa_at_end_tok,AT_END_TOK_LEN);
		ubind_len =17;
	
		aoa_send_response(ubind_back,ubind_len);
			//memcpy(ubind_back_err,"+BUNBIND:",9);
	//	memcpy(&ubind_back_err[9],&data[lenth],len-15);
	//	memcpy(&ubind_back_err[len-6],",ERROR,1",8);
		//memcpy(&ubind_back_err[len+2],aoa_at_end_tok,AT_END_TOK_LEN);
		//ubind_len_err =len+6;
	
		memset(zdev_set.bbinddev.bdev_id ,0x00,sizeof(zdev_set.bbinddev.bdev_id));
		zdev_set.bdevtask1_num = 0;
		zdev_set.bdevtask2_num = 0;

	}else{
	memset(ubind_back,0x00,50);
		memcpy(ubind_back,"+BUNBIND:",9);
		memcpy(&ubind_back[9],&data[lenth],len-15);
		memcpy(&ubind_back[len-6],",OK",3);
		memcpy(&ubind_back[len-3],aoa_at_end_tok,AT_END_TOK_LEN);
		ubind_len =len+1;
	  aoa_send_response(ubind_back,ubind_len);
		printf("ubind_back  %s  \r\n",ubind_back);
	
		memcpy(ubind_back_err,"+BUNBIND:",9);
		memcpy(&ubind_back_err[9],&data[lenth],len-15);
		memcpy(&ubind_back_err[len-6],",ERROR,1",8);
		memcpy(&ubind_back_err[len+2],aoa_at_end_tok,AT_END_TOK_LEN);
		ubind_len_err =len+6;
	//aoa_send_response(ubind_back_err,ubind_len_err);
	
	}
		
}


/*
AT+BBEAT=111234567890123,121234567890124
+BBEAT:111234567890123,10,1,ON,ON,1,,121234567890124,20,4,OFF,OFF,0,OFF
+BBEAT:1,111234567890123,OK,10,1,ON,ON,1,,121234567890124,OK,20,4,OFF,OFF,0,OFF
*/
uint16_t make_bbeat_response(uint8_t *response)
{
	uint16_t totallen=0,len=0;
	uint8_t data;
	uint8_t str[10]={0};
	
	len=strlen("+BBEAT:");
	memcpy(response,"+BBEAT:",len);
	totallen+=len;
	
	memcpy(response,"1",1);
	totallen+=len;
	
add_separator_comma(&response[totallen]);
		totallen+=1;
	
	len=strlen("01234567898");
	memcpy(response,"01234567898",len);
	totallen+=len;
	
add_separator_comma(&response[totallen]);
		totallen+=1;
	
	len=strlen("OK");
	memcpy(response,"OK",len);
	totallen+=len;

	memcpy(&response[totallen],aoa_at_end_tok,AT_END_TOK_LEN);
	totallen+=AT_END_TOK_LEN;

	return totallen;
}


uint8_t aoa_at_handle_bbeat(uint8_t *data, uint16_t len, uint8_t idx)
{
	/*uint16_t totallen;
	uint8_t response[128];*/

	osStatus ret;
	ret=task_ble_mail_put(data, len);
	return ((uint8_t)(ret));
	
	/*totallen=make_bbeat_response(response);
	return aoa_send_response(response,totallen);*/
}

uint8_t aoa_at_handle_binfowrite(uint8_t *data, uint16_t len, uint8_t idx) //需要修改 需要去连接bbind
{
	osStatus ret;
	//ret=task_ble_mail_put(data, len);
	uint16_t totallen=0, lenth = 0,lenth1 = 0;
	uint8_t id1,id2;
	uint8_t response[128];
	
	lenth = strlen("AT+BINFOWRITE=");
	if(data[lenth] == '1'){
			id1 = 1;	
			memcpy(zdev_set.bbinddev.bdev_id[0][zdev_set.bdevtask1_num],&data[lenth+2],12);
			zdev_set.bbinddev.bdev_id[0][zdev_set.bdevtask1_num][12] ='1';
			zdev_set.bdevtask1_num +=1;
	}else if(data[lenth] =='2'){
			id2 =2;
		memcpy(zdev_set.bbinddev.bdev_id[1][zdev_set.bdevtask2_num],&data[lenth+2],12);
		zdev_set.bbinddev.bdev_id[1][zdev_set.bdevtask2_num][12] ='2';
		zdev_set.bdevtask2_num +=1;		
	}

	
	
	
	lenth1=strlen("+BINFOWRITE:");
	memcpy(response,"+BINFOWRITE:",lenth1);
	totallen+=lenth1;
	
	memcpy(&response[totallen],&data[lenth],1);
	totallen +=1;
	
	add_separator_comma(&response[totallen]);
		totallen+=1;
	memcpy(&response[totallen],&data[lenth+2],12);
	totallen +=12;
	
add_separator_comma(&response[totallen]);
		totallen+=1;
	
	memcpy(&response[totallen],"OK",2);
	totallen +=2;
	
//	add_separator_comma(&response[totallen]);
	//	totallen+=1;
	///	memcpy(&response[totallen],"1",1);
	//totallen +=1;
	memcpy(&response[totallen],aoa_at_end_tok,AT_END_TOK_LEN);
	totallen+=AT_END_TOK_LEN;
	aoa_send_response(response,totallen);
	return ((uint8_t)(ret));
}

uint8_t aoa_at_handle_bbbeat(uint8_t *data, uint16_t len, uint8_t idx)
{
	osStatus ret;
	ret=task_ble_mail_put(data, len);
	return ((uint8_t)(ret));
}
uint8_t light_response[60];
uint8_t light_back_len =0;

uint8_t aoa_at_handle_blight(uint8_t *data, uint16_t len, uint8_t idx) //需要改
{
	osStatus ret;
	//ret=task_ble_mail_put(data, len);
	
	
