sunmny/z1/z1-stm32l476/Src/APP/app_aoa.c
	uint16_t totallen=0,lenth=0,lenth1 = 0;
	uint8_t id1,id2;
	//uint8_t response[60];
	uint8_t call_buf[25];
	
	
	lenth = strlen("AT+BLIGHT=");
	


	memcpy(call_buf,"call:",5);
	
	lenth1=strlen("+BLIGHT:");
	memcpy(light_response,"+BLIGHT:",lenth1);
	totallen+=lenth1;
	
	memcpy(&light_response[totallen],&data[lenth],15);
	totallen +=15;
	
	
	memcpy(&call_buf[5],&data[lenth+2],12);
	
	call_buf[17] = ',';
	call_buf[18] = '0';
	memcpy(&call_buf[19],&data[lenth],1);
	
		call_buf[20] = ',';
		
	
	//printf("light %c \r\n",data[lenth+15]);
	if(data[26] == 'N'){
		 memcpy(&call_buf[21],"01",2);	
		light_flag = 1;
			memcpy(&light_response[totallen],"ON",2);
	totallen +=2;
			send_light_commnd=1;
	}
	if(data[26] == 'F'){
			light_flag = 0;
			send_light_commnd=2;
		 memcpy(&call_buf[21],"00",2);	
			memcpy(&light_response[totallen],"OFF",3);
	totallen +=3;
	}
	
	  memcpy(&call_buf[23],"##",2);	
	if(get_timer_status()){
				 osTimerStop(LedTimerHandle);
					set_timer_status(0);
	}
		ble_send_response(call_buf,24);
	if(!get_timer_status()){
				 osTimerStart(LedTimerHandle, 3500);
					set_timer_status(1);
	}
	
		memcpy(&light_response[totallen],",",1);
	totallen +=1;
	
	memcpy(&light_response[totallen],"OK",2);
	totallen +=2;
	
	memcpy(&light_response[totallen],aoa_at_end_tok,AT_END_TOK_LEN);
	totallen+=AT_END_TOK_LEN;
	light_back_len = totallen;
	//ret = aoa_send_response(response,totallen);
	return 0;
}

uint8_t aoa_at_handle_binfoerase(uint8_t *data, uint16_t len, uint8_t idx) //need to 2640
{
	osStatus ret;
	//ret=task_ble_mail_put(data, len);
	uint16_t totallen=0,lenth=0,lenth1 = 0;
	uint8_t id1,id2;
	uint8_t response[128];
	
	
	lenth = strlen("AT+BINFOERASE=");
	
	
	lenth1=strlen("+BINFOERASE:");
	memcpy(response,"+BINFOERASE:",lenth1);
	totallen+=lenth1;
	
	memcpy(&response[totallen],&data[lenth],1);
	totallen +=1;
	
	add_separator_comma(&response[totallen]);
		totallen+=1;
	memcpy(&response[totallen],&data[lenth+2],12);
	totallen +=12;
	
add_separator_comma(&response[totallen]);
		totallen+=1;
	memcpy(&response[totallen],"OK",2);
	totallen +=2;
	//add_separator_comma(&response[totallen]);
	//	totallen+=1;
		//memcpy(&response[totallen],"1",1);
	//	totallen+=1;
	memcpy(&response[totallen],aoa_at_end_tok,AT_END_TOK_LEN);
	totallen+=AT_END_TOK_LEN;
	
	memset(zdev_set.bbinddev.bdev_id,0x00,sizeof(zdev_set.bbinddev.bdev_id));
	zdev_set.bdevtask1_num = 0;
	zdev_set.bdevtask2_num = 0;
	
	ret = aoa_send_response(response,totallen);
	return ((uint8_t)(ret));
}

uint8_t aoa_at_handle_centeraddress(uint8_t *data, uint16_t len, uint8_t idx)
{
	osStatus ret;
	ret=task_ble_mail_put(data, len);
	return ((uint8_t)(ret));
}

uint8_t aoa_at_handle_bsosinfo(uint8_t *data, uint16_t len, uint8_t idx)
{
	//osStatus ret;
	//ret=task_ble_mail_put(data, len);
	///return ((uint8_t)(ret));
	uint8_t lenth,lenth1;
	uint8_t temp_buf[20];
	
		lenth = strlen("AT+BSOSINFO=");
		
	  
								memset(temp_buf,0x00,20);
								lenth1 = strlen("+BSOSINFO:OK");
								memcpy(temp_buf,"+BSOSINFO:OK",lenth1);
								memcpy(&temp_buf[lenth1],aoa_at_end_tok,4);
								zdev_set.report_mesage_id = data[lenth] -'0';
								aoa_send_response(temp_buf,lenth1+4);
		
	
			
	
	
}

uint8_t aoa_at_handle_bsos(uint8_t *data, uint16_t len, uint8_t idx)
{
	osStatus ret;
	ret=task_ble_mail_put(data, len);
	return ((uint8_t)(ret));
}

/*todo, 20181114*/
uint8_t handle_zdevice_selfcheck(uint8_t idx)
{
}

uint8_t handle_bdevice_selfcheck(uint8_t *data, uint16_t len, uint8_t idx)
{
	osStatus ret;
	ret=task_ble_mail_put(data, len);
	return ((uint8_t)(ret));
}


uint8_t aoa_at_handle_selfcheck(uint8_t *data, uint16_t len, uint8_t idx)
{
	ZbTokenizer  tzer[1];
	ZbToken  tok_device_id;
	uint16_t headerlen=0;
	uint8_t   deviceid[DEVICE_ID_LEN],res;

	headerlen=strlen(aoa_at_table[idx].pData);
	zb_tokenizer_init(tzer, data+headerlen, data+len);
	get_zdevice_id(deviceid);

	if(tzer[0].count==2)//maybe zdevice
	{
		tok_device_id = zb_tokenizer_get(tzer,0);
		if(0==memcmp(deviceid,tok_device_id.p,DEVICE_ID_LEN))
		{
			res=handle_zdevice_selfcheck(idx);
		}
		else
		{
			res=handle_bdevice_selfcheck(data, len, idx);
		}
	}
	else
	{
		res=handle_bdevice_selfcheck(data, len, idx);
	}
	return res;
}


uint8_t aoa_at_handle_bdistance(uint8_t *data, uint16_t len, uint8_t idx) //需要给2640
{
	 uint8_t lenth =0;
		uint8_t temp_buf[20];
		uint8_t ble_buf[11];
	
	lenth = strlen("AT+BDISTANCE=");

		if(data[lenth]!= '3' && data[lenth]!= '5' &&data[lenth]!= '1'){
		//	memcpy(temp);
				aoa_send_response("+BDISTANCE:ERROR##\r\n",20);
		}else{
					if(data[lenth]== '1'){
					memcpy(ble_buf,"bdrepd:",7);
					memcpy(&ble_buf[7],&data[lenth],2);
					memcpy(&ble_buf[9],"##",2);
					ble_send_response(ble_buf,11);
				zdev_set.report_dis = (data[lenth] -'0')*10 + (data[lenth+1] - '0');
				aoa_send_response("+BDISTANCE:OK##\r\n",17);
				}else if(data[lenth]== '3'){
				memcpy(ble_buf,"bdrepd:",7);
					memcpy(&ble_buf[7],&data[lenth],1);
					memcpy(&ble_buf[9],"##",2);
					ble_send_response(ble_buf,10);
				zdev_set.report_dis = (data[lenth] - '0');
				aoa_send_response("+BDISTANCE:OK##\r\n",17);
				
				}else if(data[lenth]== '5'){
				
				memcpy(ble_buf,"bdrepd:",7);
					memcpy(&ble_buf[7],&data[lenth],1);
					memcpy(&ble_buf[9],"##",2);
					ble_send_response(ble_buf,10);
				zdev_set.report_dis = (data[lenth] - '0');
				aoa_send_response("+BDISTANCE:OK##\r\n",17);
				}
			//set_nvram_report_dis(zdev_set.report_dis);
		}
	//ret=task_ble_mail_put(data, len);
	//return ((uint8_t)(ret));
}

/*todo, need nvram to save this value. 20181114*/
uint8_t handle_zdevice_blowbattery(uint8_t lowbat)
{
	//flash_status_t ret=0;
	//uint8_t ori_bat=0;

	//get_nvram_low_battery(&ori_bat);
	//if(ori_bat^lowbat)
	//{
	//	ret=set_nvram_low_battery(lowbat);
	//}
	//return (uint8_t)ret;
}

uint8_t handle_bdevice_blowbattery(uint8_t *data, uint16_t len, uint8_t idx)//需要给2640
{
	//osStatus ret;
	//ret=task_ble_mail_put(data, len);
	//return ((uint8_t)(ret));
	
	 uint8_t lenth =0, setbat=0xff;
		uint8_t temp_buf[30];
		uint8_t ble_buf[10];
	
	lenth = strlen("AT+BLOWBATTERY=");
			
		if(data[lenth]!= '0' && data[lenth]!= '2' &&data[lenth]!= '1'){ 
			memset(temp_buf,0x00,30);
			memcpy(temp_buf,"+BLOWBATTERY:ERROR",18);
			memcpy(&temp_buf[18],aoa_at_end_tok,4);
				aoa_send_response(temp_buf,22);
		}else{
				memcpy(ble_buf,"bdrepb:",7);
				zdev_set.report_bat_threshold = data[lenth] - '0';
				memcpy(&ble_buf[7],&data[lenth],1);
				memcpy(&ble_buf[8],"##",2);
				ble_send_response(ble_buf,10);
			
				memset(temp_buf,0x00,30);
				memcpy(temp_buf,"+BLOWBATTERY:OK",15);
				memcpy(&temp_buf[15],aoa_at_end_tok,4);
			printf("bat temp %s \r\n",temp_buf);
				aoa_send_response(temp_buf,19);
			//set_nvram_low_battery(zdev_set.report_bat_threshold);
		}
}

uint8_t aoa_at_handle_blowbattery(uint8_t *data, uint16_t len, uint8_t idx)
{
	uint8_t   res;
	#if 0
	ZbTokenizer  tzer[1];
	ZbToken battery;
	uint16_t headerlen=0;
	result,lowbat;

	headerlen=strlen(aoa_at_table[idx].pData);
	zb_tokenizer_init(tzer, data+headerlen, data+len);

	battery=zb_tokenizer_get(tzer, 0);
	lowbat=(uint8_t)str2int(battery.p, battery.end);

		
	if(lowbat>=0 && lowbat<=4)
	{
		if (0==handle_zdevice_blowbattery(lowbat))
			make_zdevice_okerror_response(0,0,0,idx);
		else
			make_zdevice_okerror_response(0,0,1,idx);
	}
	else
	{
		make_zdevice_okerror_response(0,0,1,idx);
	}
#endif
	handle_bdevice_blowbattery(data, len, idx);
	return res;
}

/*todo, need nvram to save this value. 20181114*/
uint8_t handle_zdevice_zreportloctime(uint32_t time_in_second)

{
	flash_status_t ret=0;
	uint32_t ori_data=0;

	//ret=get_nvram_report_period(&ori_data);
	//if(ori_data^time_in_second)
	//{
		//ret=set_nvram_report_period(time_in_second);
	//}
	//return (uint8_t)ret;
}

uint8_t aoa_at_handle_zreportloctime(uint8_t *data, uint16_t len, uint8_t idx)//需要改动
{
	
			uint8_t lenth,count=0,lenth1;
			uint8_t temp_buf[30];
	printf("aoa_at_handle_zreportloctime \r\n");
		lenth = strlen("AT+ZREPORTLOCTIME=");
	
	
		//	if(data[lenth] ==)
				if(data[lenth] != '2' &&data[lenth] != '5' && data[lenth] != '1' ){
				
