sunmny/z1/z1-stm32l476/Src/APP/app_aoa.c
								lenth1 = strlen("+ZREPORTLOCTIME:ERROR");
								memset(temp_buf,0x00,30);
								memcpy(temp_buf,"+ZREPORTLOCTIME:ERROR",lenth1);
								memcpy(&temp_buf[lenth1],aoa_at_end_tok,4);
								aoa_send_response(temp_buf,lenth1+4);
					}else{
								lenth1 = strlen("+ZREPORTLOCTIME:OK");
								memset(temp_buf,0x00,30);
								memcpy(temp_buf,"+ZREPORTLOCTIME:OK",lenth1);
								memcpy(&temp_buf[lenth1],aoa_at_end_tok,4);
								aoa_send_response(temp_buf,lenth1+4);
					
					
					}
		
#if 0	
	while(data[count]){
				printf("aoa_at_handle_zreportloctime count %d \r\n",count);
					if(data[count] == ','){
								if(data[count+1] != '2' &&data[count+1] != '5' && data[count+1] != '1' ){
								lenth = strlen("+ZREPORTLOCTIME:ERROR");
								memset(temp_buf,0x00,30);
								memcpy(temp_buf,"+ZREPORTLOCTIME:ERROR",lenth);
								memcpy(&temp_buf[lenth],aoa_at_end_tok,4);
								aoa_send_response(temp_buf,lenth+4);
								}else{
									lenth = strlen("AT+ZREPORTLOCTIME=");
									memcpy(zdev_set.zdev_report_time,&data[lenth+13],2);
								lenth = strlen("+ZREPORTLOCTIME:OK");
								
								memset(temp_buf,0x00,30);
								memcpy(temp_buf,"+ZREPORTLOCTIME:OK",lenth);
								memcpy(&temp_buf[lenth],aoa_at_end_tok,4);
								aoa_send_response(temp_buf,lenth+4);
									printf("zpepor temp %s \r\n",temp_buf);
								
								}
					}else if((data[count] == '#')&& (data[count+1] =='#')){
					
								break;
					}
					
				count ++;
					
			}
	
#endif
	
	#if 0
	ZbTokenizer  tzer[1];
	ZbToken  tok_device_id,tok_time;
	uint32_t time_in_second;
	uint16_t headerlen=0;
	uint8_t deviceid[DEVICE_ID_LEN],res;

	headerlen=strlen(aoa_at_table[idx].pData);
	zb_tokenizer_init(tzer, data+headerlen, data+len);
	get_zdevice_id(deviceid);

	tok_device_id=zb_tokenizer_get(tzer,0);
	tok_time=zb_tokenizer_get(tzer,1);

	if(0==memcmp(deviceid,tok_device_id.p,DEVICE_ID_LEN))
	{
		time_in_second=(uint32_t)str2int(tok_time.p, tok_time.end);
		res=handle_zdevice_zreportloctime(time_in_second);
		make_zdevice_okerror_response(0,0,0,idx);
	}
	else
	{
		res=make_zdevice_okerror_response(0,0,1,idx);
	}
	return res;
	#endif
	
}

uint8_t aoa_at_handle_breportinfotime(uint8_t *data, uint16_t len, uint8_t idx) //
{
	//osStatus ret;
	//ret=task_ble_mail_put(data, len);
//	return ((uint8_t)(ret));
	
		uint8_t lenth;
		uint8_t temp_buf[30];
		uint8_t ble_buf[11];
		lenth = strlen("AT+BREPORTINFOTIME=");
	
		if(data[lenth] != '2' &&data[lenth] != '5' && data[lenth] != '1' ){
								lenth = strlen("+BREPORTINFOTIME:ERROR");
								memset(temp_buf,0x00,30);
								memcpy(temp_buf,"+BREPORTINFOTIME:ERROR",lenth);
								memcpy(&temp_buf[lenth],aoa_at_end_tok,4);
								aoa_send_response(temp_buf,lenth+4);
								}else{
								memcpy(zdev_set.bdev_report_time,&data[lenth],2);
								memcpy(ble_buf,"bdrept:",7);
								memcpy(&ble_buf[7],&data[lenth],2);
								memcpy(&ble_buf[9],"##",2);
								ble_send_response(ble_buf,11);
								lenth = strlen("+BREPORTINFOTIME:OK");
								memset(temp_buf,0x00,30);
								memcpy(temp_buf,"+BREPORTINFOTIME:OK",lenth);
								memcpy(&temp_buf[lenth],aoa_at_end_tok,4);
								aoa_send_response(temp_buf,lenth+4);
									printf("zpepor temp %s \r\n",temp_buf);
								
								}
	
	
}

uint8_t aoa_at_handle_taskover(uint8_t *data, uint16_t len, uint8_t idx)
{
	osStatus ret;
	ret=task_ble_mail_put(data, len);
	return ((uint8_t)(ret));
}
uint8_t lock_back_buf[50];
uint8_t lock_back_buf_len;

uint8_t aoa_at_handle_bboxunlock(uint8_t *data, uint16_t len, uint8_t idx)
{
	uint8_t  ret;
	//ret=task_ble_mail_put(data, len);
	uint8_t totallen=0,lenth=0,lenth1 = 0;
	uint8_t temp_buf[25];
		
	
	lenth = strlen("AT+BBOXUNLOCK=");
	memcpy(temp_buf,"olock:",6);
	memcpy(&temp_buf[6],&data[lenth+2],16);
	memcpy(&temp_buf[22],"##",2);
	ble_send_response(temp_buf, 24);

	
	lenth1=strlen("+BBOXUNLOCK:");
	memcpy(lock_back_buf,"+BBOXUNLOCK:",lenth1);
	totallen+=lenth1;
	//AT+BBOXUNLOCK=1,122019090017,ON##
	if((data[lenth+16] == 'N') && (data[lenth+15] == 'O')){
		memcpy(&lock_back_buf[totallen],&data[lenth],17);
		totallen +=17;
	
	}else if(((data[lenth+16] == 'F') && (data[lenth+15] == 'O'))){
			memcpy(&lock_back_buf[totallen],&data[lenth],18);
		  totallen +=18;
	
	}
	memcpy(&lock_back_buf[totallen],",",1);
	totallen+=1;
	
	lock_back_buf_len = totallen;
	
	//memcpy(&lock_back_buf[totallen],aoa_at_end_tok,AT_END_TOK_LEN);
	//totallen+=AT_END_TOK_LEN;
	
	//ret = aoa_send_response(lock_back_buf,totallen);
	return ((uint8_t)(ret));
}

uint8_t aoa_at_handle_rdmsg(uint8_t *data, uint16_t len, uint8_t idx)
{
	uint32_t bd1_receiver_num=179773;//136166;
	uint8_t bd1_msg_debug[5]={0x68, 0x65, 0x6c, 0x6c, 0x6f};//hello
	rd_send_msg(bd1_receiver_num, bd1_msg_debug, 5);
}


/*
AT+BDISTANCE=10
+BDISTANCE: OK
*/
uint16_t make_bdistance_response(uint8_t *response)
{
	uint16_t totallen=0,len=0;
	uint8_t data;
	
	len=strlen("+ZBEAT:");
	memcpy(response,"+ZBEAT:",len);
	totallen+=len;
	
	get_zdevice_id(&response[totallen]);
	totallen+=DEVICE_ID_LEN;
	
	add_separator_comma(&response[totallen]);
	totallen+=1;
	
	data=get_zdevice_battery();
	response[totallen]=data+0x30;
	totallen+=1;
	
	add_separator_comma(&response[totallen]);
	totallen+=1;
	
	data=get_rd_rssi();
	response[totallen]=data+0x30;
	totallen+=1;
	
	add_separator_comma(&response[totallen]);
	totallen+=1;
	
	data=get_ble_rssi();
	response[totallen]=data+0x30;
	totallen+=1;
	
	memcpy(&response[totallen],aoa_at_end_tok,AT_END_TOK_LEN);
	totallen+=AT_END_TOK_LEN;

	return totallen;
}


uint8_t aoa_uart_data_handle(uint8_t *data, uint16_t len)
{
	uint8_t i=0,atlen=0;
	
	
	//printf("aoa_uart_data_handle \r\n");
	if(len<AT_END_TOK_LEN) return 1;
//	printf("len = %d data is %s  \r\n",len,data);
	
	for(i=0;i<SUPPORT_AT_NUM;i++)
	{

		atlen=strlen(aoa_at_table[i].pData);
	
		if((0==memcmp(data, aoa_at_table[i].pData, atlen))&&aoa_at_table[i].handle!=NULL){
			
			return aoa_at_table[i].handle(data, len,i);
		
		}
	}
	return 1;
}

uint8_t aoa_mail_data_handle(uint8_t *data, uint16_t len)
{
	return aoa_send_response(data,len);
}


uint8_t aoa_uart_receive_and_handle(void)
{
	
	
	uint8_t ret=0;
	memset(aoa_uart_data_loop,0x00,sizeof(aoa_uart_data_loop));
	hw_uart1_receive(aoa_uart_data_loop, &aoa_uart_data_loop_len, 10);
		
	printf("aoa:%s \r\n",aoa_uart_data_loop);
	
	
	if (aoa_uart_data_loop_len>0)
	{
		ret=aoa_uart_data_handle(aoa_uart_data_loop, aoa_uart_data_loop_len);
		aoa_uart_data_loop_len=0;
	}
	return ret;
}

uint8_t aoa_mail_receive_and_handle(aoamail *pmail)
{
	aoa_mail_data_handle(pmail->data, pmail->len);
	
	//hw_uart2_send(pmail->data, pmail->len);/*test code*/
}


/**************only for debug test***************/

void aoa_test_mail_fun(void)
{
//	task_ble_mail_put(aoa_at_table[0].pData,8);
}


void reset_bdev_begin(void)
{
	zdev_set.bdevtask1_num =0;
	zdev_set.bdevtask2_num =0;
}
/**************only for debug test***************/
